{"itemId": "v1|110554947573|0", "title": "KOIOS Personal Blender 850W Juicer for Shakes Smoothies Seasonings Sauce Kitchen", "leafCategoryIds": ["133704"], "categories": [{"categoryId": "133704", "categoryName": "Countertop Blenders"}, {"categoryId": "11700", "categoryName": "Home & Garden"}, {"categoryId": "20625", "categoryName": "Kitchen, Dining & Bar"}, {"categoryId": "20667", "categoryName": "Small Kitchen Appliances"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/3ZoAAOSwzxNmRbdL/s-l225.jpg"}, "price": {"value": "66.28", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554947573%7C0", "seller": {"username": "testuser_pa4_demo_1", "feedbackPercentage": "100.0", "feedbackScore": 1}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/3ZoAAOSwzxNmRbdL/s-l1600.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/KOIOS-Personal-Blender-850W-Juicer-for-Shakes-Smoothies-Seasonings-Sauce-Kitchen-/110554947573?hash=item19bd969ff5:g:3ZoAAOSwzxNmRbdL", "itemLocation": {"city": "Avenel", "postalCode": "070**", "country": "US"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/qj4AAOSwoAlmRbdM/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/3ZsAAOSwzxNmRbdN/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/qj8AAOSwoAlmRbdO/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/3ZwAAOSwzxNmRbdO/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/3Z0AAOSwzxNmRbdP/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/qkAAAOSwoAlmRbdQ/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/3Z4AAOSwzxNmRbdR/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/qkEAAOSwoAlmRbdR/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/3Z8AAOSwzxNmRbdS/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/3aAAAOSwzxNmRbdT/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/3aEAAOSwzxNmRbdU/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/3aIAAOSwzxNmRbdV/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/3aMAAOSwzxNmRbdW/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/3aQAAOSwzxNmRbdn/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/qkIAAOSwoAlmRbdp/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554947573", "availableCoupons": false, "itemCreationDate": "2024-05-16T07:36:15.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "listingMarketplaceId": "EBAY_US", "item_description": "KOIOS Personal Blender 850W Juicer for Shakes Smoothies Seasonings Sauce Kitchen\nKOIOS Personal Portable Blender - 4 KEY ADVANTAGES: EFFICIENCY, DESIGN, VERSATILITY, PROTECTION.\nBoosted Power: Thanks to KOIOS personal blender, enhanced with the brand new 850 Watt powerful, pure copper, high-torque motor, nutrient-extraction blades turn your ingredients into a smoothly blended drink in a flash.\nGet More Capacity: KOIOS smoothie blender set includes 2 x 17oz travel bottles and a 10oz cup which are perfect for you to share blended shakes, smoothies, and healthy detox beverages with your family and friends.\nBetter Taste: All the ingredients are blended finely to a super-smooth texture every time for your best enjoyment.\nWonderfully Versatile: 2021 Upgraded 6-leaf blade adds more cutting per single rotation blending foods to smoothies, juices, milkshakes, sauces, jams faster and more energy-efficient, while extra flat 2-leaf blade grinds coffee beans and nuts with ease.\nSuperior Protection: Get used to dual-circuit protection - your new portable blender has obtained overheat and overload protection to prevent motor failures. The base suction cup can prevent the machine from sliding.\nEasy to Clean: The personal blender is easy to clean! A bottle brush is included to make washing the portable blender cup effortless. Exactor blades, travel bottles and lids are dishwasher safe!\nFAQ\n1. Can this personal blender crush ice cubes?\nYes. Please add more than 1/3 liquid and small ice cubes. Press down the cup intermittently to crush hard ingredients and ice cubes. (Pulse blending)\n2. Is the gasket ring of the blade removable?\nYes. Push the blade out of the base from the bottom. Here is a video on this page to show how to clean it.\n3. Is the smoothie blender dishwasher safe?\nYes, put the cups, lids and blade in the top rack of the dishwasher.\n4. My blender stops working.\nThe single blender is equipped with overheat and overload protection. If it stops working, please unplug the power cord, take out the cup and try to shake the cup or reduce the loaded capacity. Let the motor cool down for a while. If it still doesn't work, please tell us and we will provide the replacement.\n5. Can I order more bottles?\nNo, more bottles are not available currently. Now, the single blender is equipped with 2x17 Oz and 1x10 Oz cups. Tall bottles are used to make juices, milkshakes and smoothies. Small cups are usually used to grind spices, nuts or coffee beans.\n6. Do I have to hold the bottle the whole time to make it blend?\nYes, you need to hold the cup to make it blend. Effortlessly create your favorite meals within 10 seconds!\n7. How long is the w-arranty?\n3 years. If your personal smoothie blender is defective, please leave us a message and we will offer replacement at once.\nPackaging Contains:\n1 x Motor Base\n2 x 17oz Tall Cup\n1 x 10oz Cup\n1 x Cross Blade Unit\n1 x Flat Blade Unit\n2 x Spout Lid\n1 x Flat-top Lid\n1 x Sieve Lid\n1 x Cleaning brush\n1 x User Manual\nKOIOS 11 in 1 Set Smoothie Personal Blender\nKOIOS Personal Smoothie Blender with an 850-watt motor is highly efficient even for tough ingredients and whole fruits/veggies. You won’t have to worry about blending nuts, seeds, leafy greens. Prepare your beverages with KOIOS travel bottles, twist a lid on, and grab your on-the-go drink anywhere.\nProduct Specifications\n Power: 850W\nRPM: 22000\nVoltage: 120V, 60Hz\nOperating Time: ≤1min\nIntervals: ≥2min\n Standout Features\n850 Watt High-torque Power\nEnhanced version 6830 pure copper motor, dual-circuit protection for over-heat and overload. The blender will shut down automatically when over-heat or overload to protect itself and increase its lifespan.\nPulse Technology\nSlightly push down the cup to let the KOIOS Pulse Technology to blast the ice and frozen ingredients.\nEasy to Store\nCompact design makes this portable blender easy to store and takes up little space in your kitchen or RV.\nDishwasher Safe\nKOIOS blender cups and lids are made of food-grade BPA-free plastic, which is durable and can be washed in a dishwasher.\n Easy to Use\n1. Cut fruits into small cubes. Add more than 1/3 liquid to blend. Do not exceed the maximum capacity mark of the cup.\n2. Tighten the lid and put the bottle gently on the base.\n3. Press down the cup intermittently, let KOIOS Pulse Technology to blast through ice and frozen ingredients.\n4. Press the lid until you hear a clik. Grab your on-the-go drink. Share drinks with your family and friends!\n Note\n Never process boiling liquids (max 140°F/60℃).\nA new blender may produce a smell when it is used for the first time. The smell will disappear after repeated use.\nDo not blend continuously for more than 1 min.\nNot to blend with less than 1/3 liquid.\nDo not exceed the maximum capacity mark of the cup.\nKeep the appliance and its cord out of reach of children.\nCut fruits and vegetables into ¾-inch, 1-inch, otherwise, it will lead to overload and damage motor.\nIn case of a leak, before blending please check whether the blade assembly’s silicone O-ring is in the proper place and not damaged.\nUnplug the blender when not in use, before removing the cup, and before cleaning.\nThis appliance corresponds to USA power voltage standard 110V-120V.\nPayment\nDelivery details\nTerms of sales\nAbout us\nContact us\nWe accepct payment via all methods.\nBrand KOIOS\nType Personal Blenders\nAppliance Capabilities Crush Ice, Grind, Liquefy, Vegetables\nPower Source Electric\nMPN Does not apply\nModel BL219B\nFeatures Adjustable, BPA Free, Crushes Ice, Dishwasher-Safe Parts, Easy Clean, Handheld, Ice Crusher, Multipurpose, Multi-Purpose Blade\nVoltage 110V-120V\nNumber of Speeds 1\nComponents Included 1*high-torque power base, 2*500ml tall cup, 1*300ml short cup, 2*flip-top cap, 1*resealable lid, 1*steamer/shaker lid, 1* Sieve Lid, Cleaning brush, User Manual, Base, Blades\nPower 850 W\nCapacity 17 oz\nMaterial Stainless Steel\nAppliance Uses Coffee Grinder, Frozen Drink, Fruit, Juice, Nuts, Sauce, Smoothie, Vegetable\nItem Width 4.92 inches\nItem Height 9.45 inches\nColor Silver\nItem Weight 3.6 pounds\nItem Depth 11.42 inches\nManufacturer Warranty 1 Month\nNumber of Blades 2\nCountry/Region of Manufacture China\nNumber of Settings/Programs 1"}
{"itemId": "v1|110554924990|0", "title": "Automatic Brush Cleaner Electric Makeup Brush Cleaning Machine Fast Clean Dryer", "leafCategoryIds": ["159805"], "categories": [{"categoryId": "159805", "categoryName": "Brush Cleaners"}, {"categoryId": "26395", "categoryName": "Health & Beauty"}, {"categoryId": "31786", "categoryName": "Makeup"}, {"categoryId": "36409", "categoryName": "Makeup Tools & Accessories"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/jogAAOSwuaJmOdYO/s-l225.jpg"}, "price": {"value": "14.69", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554924990%7C0", "seller": {"username": "testuser_pa4_demo_5", "feedbackPercentage": "100.0", "feedbackScore": 2}, "condition": "New with box", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/jogAAOSwuaJmOdYO/s-l1600.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE", "BEST_OFFER"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/Automatic-Brush-Cleaner-Electric-Makeup-Brush-Cleaning-Machine-Fast-Clean-Dryer-/110554924990?hash=item19bd9647be:g:jogAAOSwuaJmOdYO", "itemLocation": {"country": "US"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/UpYAAOSwlOlmOdYP/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/UN0AAOSwjKtmOdYQ/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/vC0AAOSw0lJl7uNq/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/4NMAAOSwJhFl7uNp/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/toYAAOSwgTpl7uNs/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/zXsAAOSw~Mhl7uNt/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/0VwAAOSw~FRl7uNm/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/9A4AAOSwM2Zl7uNr/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/zoMAAOSw8Pxl7uNw/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/7aUAAOSwlyJl7uNo/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/G8kAAOSwGvNmOdYS/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/B1sAAOSw2VZmOdYT/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/lOwAAOSwUBJl7uNu/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/yBsAAOSw0YpmOdYU/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/zSkAAOSwO~Rl7uNn/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/lNAAAOSwXItl7uNx/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/mCEAAOSwFC5lztO9/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554924990", "availableCoupons": false, "itemCreationDate": "2024-05-07T07:25:13.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "listingMarketplaceId": "EBAY_US", "item_description": "Automatic Brush Cleaner Electric Makeup Brush Cleaning Machine Fast Clean Dryer\n🏖️Description\nOur electric makeup brush cleaner is newly upgraded and immediately become an necessary for every girl to free themself from all the trouble on cleaning their brushes, This Electric Makeup Brush Cleaner is very practical. It not only saves you the trouble of manually cleaning your makeup brushes but also meets your different cleaning needs. It provides great convenience for your life，get one for yourself without any hesitation.\nTips\nStep One: Pour certain amount of water and cleaning liquid, make sure that the water is below the max line marked.\nStep Two: Press the button to start the machine and wait till the cleaning procedure finish.\nStep Three: Reverse the topper for the brush to be dried naturally.\nStep Four: Reverse the topper again to storage the brush and keep it from dust.\n🏝️Features\n【ELECTRIC MAKEUP BRUSH CLEANER】Save time and effort, no need to assemble, large capacity. Are you still scrubbing your makeup brushes by hand on the makeup brush cleaning mat? Are you still using an old-fashioned makeup brush cleaner? The Makeup Brush Cleaner automatically cleans multiple makeup brushes at a time, and it works with almost all sizes of makeup brushes. From small eye shadow brushes to large foundation brushes, it handles them all with ease.\n【3-IN-1 DESIGN】Unlike traditional manual cosmetics brush cleaners, we combine the functions of washing, drying and storage. After you finish cleaning, you can turn the silicone cover upside down to dry. Finally, you can insert the makeup brush into the silicone case and store it to avoid dust.\n【DEEP CLEANING】The Makeup Brush Cleaner is professional and impressive. Let's give your makeup brushes a powerful bath together and see how much dirty makeup residue brushes are harboring. Based on sonic vibration with a 7000rpm/min speed, this cosmetic brush cleaner effectively removes residues, oils, and impurities from brush crevices, grooves, and even tight corners without damaging the brush's shape and softness. The transparent body provides a clear view of the cleaning process.\n【COMPACT AND PORTABLE】: Our makeup brush cleaner is compact and travel-friendly. With the included USB charging cable and adapter, use it anywhere – be it your bedroom, bathroom, or on travel during outings, travel, or work. Keep your brushes clean wherever you are.\n【EASY TO OPERATE】The automatic makeup brush cleaner is powered by USB and is easy to operate, just add water and cleaning solution, press the switch and it is ready to use (don't exceed the maximum amount of water). Turn the silicone cap upside down to air dry the brushes after deep cleaning or use this brush blender for storing makeup brushes. Be sure to use a 5V2A adapter plug, otherwise it will not work and the touch switch will be out of order.\n【EXQUISITE AND PORTABLE】As a makeup lover, it's vital to keep beauty and makeup tools hygienic. This makeup brush cleaner is delicate and beautiful, and can be easily fit into cosmetic collection to add style to your beauty routine. Cosmetic brush cleaner is small and portable, can be taken with you when traveling and playing, so you can stay beautiful at all times. The silicone cap fits almost all brushes, but for oversized and irregularly shaped brushes, you’ll need to clean them manually.\n【PERFECT GIFT】This spinning makeup brush cleaner frees your hands and makes cleaning makeup brushes easier and faster, perfect for women who care about the health of their face skin, family members, professional makeup artists and makeup enthusiasts. Electric Makeup brush cleaner is a perfect gift for your beloved ones on Valentine's Day, Christmas, anniversary or birthday. Trust me, you will love this makeup brush cleaner machine after using it!\n【WARM TIPS】⚠1.Please make sure to use 5V2A adapter plug, otherwise it will not work properly and the switch will be out of work. ⚠2.Do not fill the water beyond the maximum water mark. ⚠3.The makeup brush cleaner is based on sonic vibration for cleaning, it will not damage the shape of makeup brushes. ⚠4.The silicone lid's micro-elastic make it suitable for all brushes, but for oversized and irregularly shaped brushes, you need to clean them manually.\n⛲Specification\nMaterial: ABS+PC+TPE\nColor: White / clear\nSize: 16*9*9 cm / 6.3*3.5*3.5 inch (approximately)\nVoltage: 5V\nRated power: 8W\nRated current: 1.5A\nWorking mode: 5V inline\nSpeed: 7000 rpm\nBattery: Built-in-800mAh Battery （ Rechargeable ）\n🪂Package Included\n1 X Electric cleaning brush\n1 X charger\n1 X instructions\n🗽Note\n⚠1.Please make sure to use 5V2A adapter plug, otherwise it will not work properly and the switch will be out of work. \n⚠2.Do not fill the water beyond the maximum water mark.\n⚠3.The makeup brush cleaner is based on sonic vibration for cleaning, it will not damage the shape of makeup brushes. \n⚠4.The silicone lid's micro-elastic make it suitable for all brushes, but for oversized and irregularly shaped brushes, you need to clean them manually.\nPayment\nDelivery details\nTerms of sales\nAbout us\nContact us\n1.We gladly accept payment methods eBay approved.\n2.Please make sure your eBay address is correct before you pay.\n3.All payment Should be Completed within 7 days, or an unpaid disputed will be opened as payment none receive.\n4.If you do not want to pay for the order please contact us via eBay message, we will help your cancel the transaction.\n5.Please make sure to submit the eBay item number with your payment. If you have any special requirements or requests, please contact via eBay message."}
