{"itemId": "v1|110554961677|0", "title": "Car Diagnostic Tools Code Reader Clear Engine Light Smog Test Scanner Automotive", "leafCategoryIds": ["179486"], "categories": [{"categoryId": "179486", "categoryName": "Other Diagnostic Service Tools"}, {"categoryId": "6000", "categoryName": "eBay Motors"}, {"categoryId": "34998", "categoryName": "Automotive Tools & Supplies"}, {"categoryId": "179474", "categoryName": "Diagnostic Service Tools"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/EGIAAOSw7StluMP6/s-l225.jpg"}, "price": {"value": "10.99", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554961677%7C0", "seller": {"username": "testuser_pa4_demo_4", "feedbackPercentage": "0.0", "feedbackScore": 500}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/EGIAAOSw7StluMP6/s-l1600.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE", "BEST_OFFER"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/Car-Diagnostic-Tools-Code-Reader-Clear-Engine-Light-Smog-Test-Scanner-Automotive-/110554961677?hash=item19bd96d70d:g:EGIAAOSw7StluMP6", "itemLocation": {"city": "Chino", "postalCode": "917**", "country": "US"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/oxkAAOSwmNRmTG7Z/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/z88AAOSwgGxk0eI4/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/N54AAOSwwQJk0eI1/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/ZcoAAOSwq6Nk0eI0/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/bhUAAOSwBTJk0eIy/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/rr0AAOSwZc5k0eIx/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/7MYAAOSwSpFlqQ8n/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/ZuoAAOSw3vdlpX5V/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/7NoAAOSw6J5lpX5U/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/NsEAAOSwm4FlpbaA/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554961677", "availableCoupons": false, "itemCreationDate": "2024-05-22T10:08:01.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "item_description": "Car Diagnostic Tools Code Reader Clear Engine Light Smog Test Scanner Automotive\nAttention:\nThe color of the screen pages in the latest version of MUCAR CDL20 is blue\nWhy You Need MUCAR CDL20?\nFeaturing all modes of OBDII functions, DTC Lookup,Plug and Play etc.,it is truly the ultimate entry-level choice in ease and affordability, enabling DIY users to verify repairs,road test,check state emission monitor status and solve basic engine and driveability problems.\n\nFull OBD2 Functions:\n★Read Codes:Read extensive current, pending and permanent codes in OBD system quickly\n★Clean Codes:Clear detected fault codes and turn off the Check Engine Light efficiently\n★Live Date:View graphical live data of vehicle's computer module(s) for easy analyses\n★Freeze Frame:View the vehicle's operating parameters at the moment a DTC is detected\n★I/M readiness:Read I/M readiness status to have a vehicle inspected for state emissions compliance\n★O2 sensor test:Perform O2 sensor test to check fuel efficiency and vehicle emissions\n★On-Borad Monitor Test:Read the results of on-board diagnostic monitoring tests for specific components/systems\n★Car Information Display:Retrieve the vehicle information of VIN, CINs, and CVNs completely\n★EVAP Test:Perform the component Test by allowing initiating a leak test for the vehicle's EVAP system\nSupport 7 Languages:\nIt also supports 7 languages that include English, Portuguese, Russian, Italian, Spanish, French, Polish and German.\n\nSupport Vehicle Coverage:\nMUCAR CDL20 is compatible with most American, European, and Asian models manufactured as from 1996.It supports all OBDII protocols: KWP2000,ISO9141,J1850 VPW,J1850 PWM and CAN (Controller Area Network).If you don't know your car OBD2 protocols that you could check your car OBD2 connector whether 16 Pin.If yes.This goods support to your car.Please take attention.This goods just check for your car engine.\n\nWarning Notice:\n1.Even though it compatible with most cars,but different regions support the vehicle OBD2 protocol at different times, or some car is special design,so it may not compatible with some cars which do not support OBD2 protocol.Especially Japanese and Korean car brand.\n2.Not Support Russian Cars before 2012,VAZ,UAZ,LADA;Not works with 24V trucks.\nFor Renault,SsangYong,please contact us before purchasing.\n Reset Check Engine Light\nMUCAR CDL20 enables you to clear the engine warning light, after completing the full obd2 diagnostics with ease. The main purpose of this tool is to: \n★Scan the engine systems; \n★Tell you about the nature of the issue; \n★Give an accurate reason why the engine check light is on;\n★Help to detect any potential problems; \n★Avoid excessive costs for unnecessary repairs.\n★The warning light does not turn off till you fix the issue.\n \nPass Emission Test Smoothly\nWith this scan tool, you don’t have to drive around endlessly, continuously coming back to the repair shop for the retest.\nYou can do a quick check of the v=ehicle, to determine if it is ready to pass the emission test.\nDTC Lookup Support\nGet DTC’s definition in no time with the DTC Lookup function. Never waste time on Google or taking your dictionary out when you want to know the meaning of any DTC. For vehicle compatibility, feel free to go for customer service. You’ll get a satisfactory reply in a short time.\nPass Emission Test Smoothly\nWith this scan tool, you don’t have to drive around endlessly, continuously coming back to the repair shop for the retest.\nYou can do a quick check of the vehicle, to determine if it is ready to pass the emission test.\nI/M Readiness\nCheck the readiness of the monitoring system. It is an excellent function to use prior to having a vehicle inspected for compliance to a state emissions program.\nO2 Sensor Test\nRetrieve O2 sensor monitor test results for the most recently performed tests from the vehicle’s on-board computer.\nOn-Board Monitor\nView the results of On-Board Monitor tests. The tests are useful after servicing or after erasing a vehicle’s control module memory.\nGet Effective Diagnostic Result\nYour repair work can be done in a short time by using THINKOBD as follows\nVehicle Information\nDisplay the vehicle identification number (VIN), the calibration identification (CIN), and the calibration verification number (CVN), and other information of the test vehicle.\nEVAP Test\nMode $08 command tells your car to start a test of the “evaporative emission control system”, to prevent fuel from evaporating out of your tank and contributing to smog.\nBy this way, you can verify your fix right away, without waiting a few days (or longer) for your car to run it automatically.Freeze Frame Data\nSnapshot the precise conditions of the car when a fault code triggers the check engine light, to help identify the problem.\nLive Data Stream\nDisplay the real time PID data from ECU (as analog inputs and outputs, digital inputs and outputs, and system status information broadcast on the vehicle data stream)\nThe live data produced is accurate and tells you exactly what you require to know about your vehicle.\n Other User-Friendly Features\n1.Plug & Play\nYou just need to connect the diagnostic cable into the vehicle’s DLC socket, and the code reader gets the power directly from the vehicle.\n2.Easy-to-use Keypad\nThe reader has 4 button keypad buttons that make the menu super easy to scroll.\nMUCAR CDL20 users can operate up and down, press OK or use the enter button pretty easily, with a solid and effective touch to their delight.\n3.Compact Design\nThe reader has a compact ergonomic design which makes it fit in the palm quite comfortably, especially made for people who don’t want bulky devices.\n\nPACKAGE LIST:\n1*Main Unit\n1*Quick Start Guide\nBrand MUCAR\nManufacturer Part Number Does Not Apply\nOBD Interface EOBD, OBD, OBDII\nConnectivity OBD2\nSupported System ECM\nVehicle Type Passenger Vehicle\nFeatures Backlit Display, Check Engine Light Shut Off, Color Display, Erases Codes, Freeze Frame Displays, LCD Display, Multi-Language Interface, User Friendly\nAccessories Adapter Cable, USB Cable\nWarranty 1 Year\nFit Car 1 after 1996 US-Based Cars\nFit Car 2 2000 and newer EU Cars\nFit Car 3 2008 and newer Asia Cars\nFunction 1 Freeze Frame\nFunction 2 O2 Sensor Test\nFunction 3 I/M Readiness Status\nFunction 4 Live Data Stream\nFunction 5 Vehicle Information\nFunction 6 On-Board Monitor Test\nModel MUCAR CDL 20\nType Automotive Scanner Code Reader OBDII CAN OBD2\nUnit Quantity 1\nUnit Type Unit\nSimilar AL329 ML329 AL419"}
{"itemId": "v1|110554962800|0", "title": "VIDENT 310Pro Automotive OBD2 Scanner Reader Check Engine Fault Diagnostic Tools", "leafCategoryIds": ["179476"], "categories": [{"categoryId": "179476", "categoryName": "Code Readers & Scanners"}, {"categoryId": "6000", "categoryName": "eBay Motors"}, {"categoryId": "179474", "categoryName": "Diagnostic Service Tools"}, {"categoryId": "34998", "categoryName": "Automotive Tools & Supplies"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/dpEAAOSwUHNmTuak/s-l225.jpg"}, "price": {"value": "49.00", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554962800%7C0", "seller": {"username": "testuser_pa4_demo_5", "feedbackPercentage": "100.0", "feedbackScore": 2}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/dpEAAOSwUHNmTuak/s-l1600.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE", "BEST_OFFER"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/VIDENT-310Pro-Automotive-OBD2-Scanner-Reader-Check-Engine-Fault-Diagnostic-Tools-/110554962800?hash=item19bd96db70:g:dpEAAOSwUHNmTuak", "itemLocation": {"country": "US"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/z88AAOSwOlBkul7N/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/ZoYAAOSw9NVkul7O/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/c5QAAOSwI8Rku1U7/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/ob4AAOSw-0hkul7T/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/hWMAAOSw1Lpkul7P/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/y1EAAOSwg81kul7S/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/SgoAAOSwqG1kul7Q/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/yJoAAOSwTNlkul7W/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/10kAAOSwShpkul7V/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/RrYAAOSwafZkul7R/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/js8AAOSwfLdkul7U/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/i~oAAOSw~y9kul7U/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/ckkAAOSwmEBmIPHO/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/Lv0AAOSwIvRkul7W/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/PEUAAOSw6Ydl~IXi/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/UBgAAOSw6v1kul7X/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554962800", "availableCoupons": false, "itemCreationDate": "2024-05-23T06:48:16.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "item_description": "📦📦US Stock, it will take 2-5 business days to arrive your home\n ☑️Vident iEasy310Pro OBD2 Scanner Advantage\n 👍【Works with most 1996 and newer OBDII & CAN】 compliant cars, works with all 12V standard OBD2 Protocols Vehicles(Cars, Light-duty trucks, SUVs, Mini VANs, Mini trucks,12V minibus and hybrid sold worldwide. \n  👍【All 10 Modes of OBDII Tests】 iEasy310Pro OBDII scanner can perform all 10 modes of OBDII tests for complete OBD2 diagnosis, including reading codes, erase codes, view live data, patented one-click smog check, freeze frame data, O2 monitor test, on-board monitor test, component test, view vehicle information, module present. iEasy310Pro scanner is the most complete & cost-effective OBD2 code reader for home mechanics and DIYers to solve check engine light issues and daily quick checks.\n👍【Turn off Check Engine Light(MIL)】The check engine light (CEL) illuminates when your vehicle's computer believes there is a problem that could affect, or is affecting your car's emissions control system. This check engine code reader brings a fast access to scan, read the car emissions-related error code (DTCs), troubleshooting to find the root causes of problems, clear the trouble code and turn off the MIL (Malfunction Indicator Light) after fixed.\n👍【Read/Clear Codes and Quick DTC LOOKUP】A Diagnostic Trouble Code (DTC) is set in a vehicle's onboard computer when a fault occurs in any monitored system. DTC codes are sent to the vehicle's instrument panel to trigger a warning light. This car check engine light scanner retrieves generic codes, manufacturer specific codes, pending codes, permanent codes and displays DTC definitions on the TFT screen, find out the root causes and clear the codes after fixed.\n👍【Patented One-Click Smog Check & User-Friendly Design】iEasy310Pro engine analyzer features patented I/M One-Click Readiness Key for quick State Emissions readiness check(smog check) and drive cycle verification. Coming with a TFT color display to show DTC definitions more clearly, a built-in speaker provides an audible indication, an LED Indicator, and a long cable,  is super easy to use even if you are new to a car repair\n 👍【Live Data Graph and Retrieve Freeze Frame】This engine scanner code reader can read data from vehicle sensors, such as Engine RPM, Intake air temperature, Short/Long term fuel, Misfire data, Throttle position, Engine coolant temperature, Oxygen sensor voltages, Mass air flow and ect. Display 4 PIDs simultaneously and merge them into one to compare. Retrieve freeze frame: DTCFRZF, FUELSYSA, ETC, SHRTFT1, LONGFT1, MAP, RPM, VSS, IAT....etc. \n  👍【Lifetime Software Update & Support 11 Kinds of Languages】iEasy310Pro car diagnostic reader comes with lifetime Free software updates via internet and multilingual menu options like English, French, German, Russian, Spanish, Italian, Portuguese, Hungarian, Swedish, Slovak, Czech.\n 🔔Please Note:\n1. Update support is limited to a windows based device, Not Support MAC or iOS.\n2. This product only supports voltage test and does not support battery parameter detection.\n ☑️Customize Your Boot Interface\nDIY Functionfor you to customize your own boot interface. Default setting is boot with Vident logo, but you can replace it with any picture you prefer or with your own logo!\nMost functions better than the CR3001,AS500,NT301,ELM327\nVident iEasy310Pro OBDII car diagnostic scan tool is a hand-held design diagnostic device for professional and DIYers, it supports full OBD2 functions to help you read and erase diagnostic trouble codes. One-key I/M readiness helps you to check state emissions readiness and drive cycle verification. With DIY Function, you can put your favorite picture on the screen.\n☑️Full 10 OBD2/EOBD Functions\nFeaturing 10 modes of OBD2 tests, iEasy310 Pro can be compatible with most OBDII protocol compliant cars to read and clear emission codes, show live data, O2 sensor test, On-Board monitor test, component test and view vehicle information etc.\n1. Read Code: Read DTCs (Diagnostic Trouble Codes) to locate the issues\n2. Erase Code:Clear DTCs to turn off the Check Engine Light after certain repairs\n3. Live Data:Display the real time PID data from ECU (as analog inputs and outputs, digital inputs and outputs, and system status information broadcast on the vehicle data stream). The live data produced is accurate and tells you exactly what you require to know about your vehicle.\n4. Freeze Frame: Snapshot the precise conditions of the car when a fault code triggers the check engine light, to help identify the problem.\n5. I/M readiness: Check the readiness of the monitoring system. It is an excellent function to use prior to having a vehicle inspected for compliance to a state emissions program.\n6. O2 Sensor Test:Retrieve O2 sensor monitor test results for the most recently performed tests from the vehicle’s on-board computer.\n7. On-Board Monitor Test:Retrieve the test results for emission-related powertrain systems and components that are not continuously monitored to figure out on-board monitor issues\n8. Vehicle Information: Display the vehicle identification number (VIN), the calibration identification (CIN), and the calibration verification number (CVN), and other information of the test vehicle.\n9. Component Test:Certain vehicle components can be actuated by commands sent from the scanner to test their operability\n10. DTC Lookup:Every code in iEasy310Pro comes with a description to aid technicians in efficient vehicle diagnostics and repair.This will save you the trouble of having to go online to look for the meaning of a diagnostic trouble code. And you can also simply click on the error code selected so as to get an in-depth definition.\n ☑️Check & Turn Off Engine Light(MIL)\niEasy310 Pro Check & Turn Off Engine Light, Find out what s wrong with your car and perhaps fix it. Save money and time.\n ☑️How to Update Vident iEasy310 Pro？\n1. Download the update tool iEasy310 Pro and update files from Vident Official Website and save the applications and files in computer disk.\n2. Double click the iEasy310 Pro desk Top icon to launch the application.\n3. Click Setting and select the language you want to update.\n4. Press and hold HELP key. Do not release the HELP key, then connect the USB cable.\n5. When the tool enters the Update Mode, the application would detect the tool automatically.\n6. Check the files you want to update. Click “Print” Option, Print DTC Data.\n ☑️Covered 10000+ Cars Model\nAmerica(USA) :\nCompatible with 12V Standard OBD2 Cars from 1996 to Now\nFor Chrysler; For Ford; For GM; For Jeep; For GMC; For BUICK; For Saturn; For Pontiac; For Chery\nEurope:\nCompatible with 12V Standard OBD2 Cars from 1996 to Now\nFor Alfa Romeo; For SAAB; For Acura; For Opel; For Audi; For Seat; For Bentley; For Skoda; For Daewoo; For  Benz; For Daihatsu; For Land Rover ( after 2005 year - ) , For BMW; For Vauxhall; For Volvo; For Fiat; For VW ( after 2005 year - ) ; For Ford;For Jaguar\nAsian:\nCompatible with 12V Standard OBD2 Cars from 2005 to Now\nFor KIA; For Isuzu; For Honda; For Mitsubishi; For Hyundai; For Dacia; For Lexus; For Mazda; For Nissan; For Subaru; For Suzuki; For Toyota\nAustralia:\nCompatible with 12V Standard OBD2 Cars from 2004 to Now\nFor Holden; For Ford\n🔔🔔Note: Even though it compatible with most cars, but different regions support the vehicle OBD2 protocol at different times,  so it may not compatible with some cars which do not support OBD2 protocol.If you are not sure whether it is support your car,please offer Car Brand, models and release year to seller to check it for you.\nFor Example : Toyota corolla, 2008，VIN:xxxxxx\n🔔🔔Warning:\nNot Support Russian Cars VAZ, UAZ, LADA ; Not works with trucks\nNot Support for Renault Clio 2/Megane/Dacia Logan etc.\nNot Support for Ssangyong Actyon, from 2009 to 2017 years.\nNot Support for Ssangyong Korando, 2.0 TD Diesel, from 2013 to 2017 years.\nNot Support for Ssangyong Kyron, 2.0 Diesel, from 2010 to 2017 years.\nNot Support for Ssangyong Rexton, 2011 to 2017 years.\nNot Support for Passat 1.9Tdi 2000\n ⭐Package List：\n1PC x Vident iEasy310 pro Scanner\n1PC x USB cable\n1PC x Manual\n   ☑️I/M Readiness One-Key Fast Check\nVident iEasy310Pro car fault code reader designed with 2.8'' TFT color screen, featuring with three color LED Indicators with alarm, One-Click I/M Readiness Quick check the emissions readiness and verification of drive cycle. Detect emission status and READ/CLEAR Trouble Code Hot keys to help you search trouble codes easily.\n☑️ Supports 12V Standard Vehicles Battery Voltage Test\nVIDENT iEASY 310Pro OBDII Code reader car diagnostic tool with reset, which can test and display the voltage of the battery analyze battery healthy status, view charging status, and detect faults and bad cells and give you an accurate test result.\n☑️DTC Lookup & Code Breaker\nEvery code in iEasy310 Pro comes with a description to aid technicians in efficient vehicle diagnostics and repair. This will save you the trouble of having to go online to look for the meaning of a diagnostic trouble code. And you can also simply click on the error code selected so as to get an in-depth definition.\n☑️ Lifetime Free Software Update via USB Connected to PC and Print DTC Data\niEasy310Pro car diagnostic reader provides lifelong free software updates via the Internet. There is no limit to the number of updates and functions. All functions and models are free of charge. The main purpose of the update is to add more models, fix errors, and bring you a better experience\niEasy310Pro Support Print Data From Diagnostic Tool To Computer Which More Convenience For You To View The Data. This Function Allows You To Send The Data To Your Mechanic For Help.\n    ☑️ 4 In 1 Live Data Graph\nReal-Time View of Data Streams Graphing & Logging. Display the real time PID data from ECU (as analog inputs and outputs, digital inputs and outputs, and system status information broadcast on the vehicle data stream). Support Multi- Parameter Display Graphics At the Same Time For Better Analysis of Vehicle Conditions, tells you exactly what you require to know about your vehicle.\n☑️Vident iEasy310Pro OBD2 Scanner is Compatible Multi-Vehicles from the US, Europe, Asia.\nSupported Protocols: J1850-41.6, J1850-10.4, ISO9141, KWP2000 (ISO 14230), and CAN (Control Area Network ISO 11898)\n  ☑️ Vident iEasy310 Pro Support11 Kinds of Languages:  \nEnglish, French, German, Russian, Spanish, Italian, Portuguese, Hungarian, Swedish, Slovak, Czech\n🔔🔔Note:There is no Polish and Netherland language. When you receive, get others languages by update tool.\n  ☑️Advance Technical Specifications:\nDisplay: 2.8” LCD color screen   \nOperating Temperature: 0 to 60°C (32 to 140°F)\nStorage Temperature: -20 to 70°C (-4 to 158°F)\nPower: 8-18V Vehicle   \nUnit Dimensions : 147*90*30(mm)  \nWeight: 450g\nPAYMENT\nDELIVERY DETAILS\nRETURN\nABOUT US\nContact us\n1.We accept PayPal payment,PayPal Credit,Credit card or debit card and so on.\n2.Please pay immediately after purchase.\n3.We will leave a positive feedback immediately after payment is received. We appreciate a positive feedback as much as you do. If for some reason there is any issue with the purchase, please contact us prior to leaving feedback, we will be glad to work together and provide a satisfying solution."}
{"itemId": "v1|110554962846|0", "title": "VIDENT 310Pro Automotive OBD2 Scanner Reader Check Engine Fault Diagnostic Tools", "leafCategoryIds": ["179476"], "categories": [{"categoryId": "179476", "categoryName": "Code Readers & Scanners"}, {"categoryId": "6000", "categoryName": "eBay Motors"}, {"categoryId": "179474", "categoryName": "Diagnostic Service Tools"}, {"categoryId": "34998", "categoryName": "Automotive Tools & Supplies"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/dpEAAOSwUHNmTuak/s-l225.jpg"}, "price": {"value": "49.00", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554962846%7C0", "seller": {"username": "testuser_pa4_demo_4", "feedbackPercentage": "0.0", "feedbackScore": 500}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/dpEAAOSwUHNmTuak/s-l1600.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE", "BEST_OFFER"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/VIDENT-310Pro-Automotive-OBD2-Scanner-Reader-Check-Engine-Fault-Diagnostic-Tools-/110554962846?hash=item19bd96db9e:g:dpEAAOSwUHNmTuak", "itemLocation": {"country": "US"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/z88AAOSwOlBkul7N/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/ZoYAAOSw9NVkul7O/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/c5QAAOSwI8Rku1U7/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/ob4AAOSw-0hkul7T/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/hWMAAOSw1Lpkul7P/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/y1EAAOSwg81kul7S/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/SgoAAOSwqG1kul7Q/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/yJoAAOSwTNlkul7W/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/10kAAOSwShpkul7V/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/RrYAAOSwafZkul7R/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/js8AAOSwfLdkul7U/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/i~oAAOSw~y9kul7U/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/ckkAAOSwmEBmIPHO/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/Lv0AAOSwIvRkul7W/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/PEUAAOSw6Ydl~IXi/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/UBgAAOSw6v1kul7X/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554962846", "availableCoupons": false, "itemCreationDate": "2024-05-23T07:22:53.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "item_description": "📦📦US Stock, it will take 2-5 business days to arrive your home\n ☑️Vident iEasy310Pro OBD2 Scanner Advantage\n 👍【Works with most 1996 and newer OBDII & CAN】 compliant cars, works with all 12V standard OBD2 Protocols Vehicles(Cars, Light-duty trucks, SUVs, Mini VANs, Mini trucks,12V minibus and hybrid sold worldwide. \n👍【All 10 Modes of OBDII Tests】 iEasy310Pro OBDII scanner can perform all 10 modes of OBDII tests for complete OBD2 diagnosis, including reading codes, erase codes, view live data, patented one-click smog check, freeze frame data, O2 monitor test, on-board monitor test, component test, view vehicle information, module present. iEasy310Pro scanner is the most complete & cost-effective OBD2 code reader for home mechanics and DIYers to solve check engine light issues and daily quick checks.\n👍【Turn off Check Engine Light(MIL)】The check engine light (CEL) illuminates when your vehicle's computer believes there is a problem that could affect, or is affecting your car's emissions control system. This check engine code reader brings a fast access to scan, read the car emissions-related error code (DTCs), troubleshooting to find the root causes of problems, clear the trouble code and turn off the MIL (Malfunction Indicator Light) after fixed.\n👍【Read/Clear Codes and Quick DTC LOOKUP】A Diagnostic Trouble Code (DTC) is set in a vehicle's onboard computer when a fault occurs in any monitored system. DTC codes are sent to the vehicle's instrument panel to trigger a warning light. This car check engine light scanner retrieves generic codes, manufacturer specific codes, pending codes, permanent codes and displays DTC definitions on the TFT screen, find out the root causes and clear the codes after fixed.\n👍【Patented One-Click Smog Check & User-Friendly Design】iEasy310Pro engine analyzer features patented I/M One-Click Readiness Key for quick State Emissions readiness check(smog check) and drive cycle verification. Coming with a TFT color display to show DTC definitions more clearly, a built-in speaker provides an audible indication, an LED Indicator, and a long cable,  is super easy to use even if you are new to a car repair\n👍【Live Data Graph and Retrieve Freeze Frame】This engine scanner code reader can read data from vehicle sensors, such as Engine RPM, Intake air temperature, Short/Long term fuel, Misfire data, Throttle position, Engine coolant temperature, Oxygen sensor voltages, Mass air flow and ect. Display 4 PIDs simultaneously and merge them into one to compare. Retrieve freeze frame: DTCFRZF, FUELSYSA, ETC, SHRTFT1, LONGFT1, MAP, RPM, VSS, IAT....etc.\n👍【Lifetime Software Update & Support 11 Kinds of Languages】iEasy310Pro car diagnostic reader comes with lifetime Free software updates via internet and multilingual menu options like English, French, German, Russian, Spanish, Italian, Portuguese, Hungarian, Swedish, Slovak, Czech.\n🔔Please Note:\n1. Update support is limited to a windows based device, Not Support MAC or iOS.\n2. This product only supports voltage test and does not support battery parameter detection.\n ☑️Customize Your Boot Interface\nDIY Functionfor you to customize your own boot interface. Default setting is boot with Vident logo, but you can replace it with any picture you prefer or with your own logo!\nMost functions better than the CR3001,AS500,NT301,ELM327\nVident iEasy310Pro OBDII car diagnostic scan tool is a hand-held design diagnostic device for professional and DIYers, it supports full OBD2 functions to help you read and erase diagnostic trouble codes. One-key I/M readiness helps you to check state emissions readiness and drive cycle verification. With DIY Function, you can put your favorite picture on the screen.\n☑️Full 10 OBD2/EOBD Functions\nFeaturing 10 modes of OBD2 tests, iEasy310 Pro can be compatible with most OBDII protocol compliant cars to read and clear emission codes, show live data, O2 sensor test, On-Board monitor test, component test and view vehicle information etc.\n1. Read Code: Read DTCs (Diagnostic Trouble Codes) to locate the issues\n2. Erase Code:Clear DTCs to turn off the Check Engine Light after certain repairs\n3. Live Data:Display the real time PID data from ECU (as analog inputs and outputs, digital inputs and outputs, and system status information broadcast on the vehicle data stream). The live data produced is accurate and tells you exactly what you require to know about your vehicle.\n4. Freeze Frame: Snapshot the precise conditions of the car when a fault code triggers the check engine light, to help identify the problem.\n5. I/M readiness: Check the readiness of the monitoring system. It is an excellent function to use prior to having a vehicle inspected for compliance to a state emissions program.\n6. O2 Sensor Test:Retrieve O2 sensor monitor test results for the most recently performed tests from the vehicle’s on-board computer.\n7. On-Board Monitor Test:Retrieve the test results for emission-related powertrain systems and components that are not continuously monitored to figure out on-board monitor issues\n8. Vehicle Information: Display the vehicle identification number (VIN), the calibration identification (CIN), and the calibration verification number (CVN), and other information of the test vehicle.\n9. Component Test:Certain vehicle components can be actuated by commands sent from the scanner to test their operability\n10. DTC Lookup:Every code in iEasy310Pro comes with a description to aid technicians in efficient vehicle diagnostics and repair.This will save you the trouble of having to go online to look for the meaning of a diagnostic trouble code. And you can also simply click on the error code selected so as to get an in-depth definition.\n ☑️Check & Turn Off Engine Light(MIL)\niEasy310 Pro Check & Turn Off Engine Light, Find out what s wrong with your car and perhaps fix it. Save money and time.\n ☑️How to Update Vident iEasy310 Pro？\n1. Download the update tool iEasy310 Pro and update files from Vident Official Website and save the applications and files in computer disk.\n2. Double click the iEasy310 Pro desk Top icon to launch the application.\n3. Click Setting and select the language you want to update.\n4. Press and hold HELP key. Do not release the HELP key, then connect the USB cable.\n5. When the tool enters the Update Mode, the application would detect the tool automatically.\n6. Check the files you want to update. Click “Print” Option, Print DTC Data.\n ☑️Covered 10000+ Cars Model\nAmerica(USA) :\nCompatible with 12V Standard OBD2 Cars from 1996 to Now\nFor Chrysler; For Ford; For GM; For Jeep; For GMC; For BUICK; For Saturn; For Pontiac; For Chery\nEurope:\nCompatible with 12V Standard OBD2 Cars from 1996 to Now\nFor Alfa Romeo; For SAAB; For Acura; For Opel; For Audi; For Seat; For Bentley; For Skoda; For Daewoo; For  Benz; For Daihatsu; For Land Rover ( after 2005 year - ) , For BMW; For Vauxhall; For Volvo; For Fiat; For VW ( after 2005 year - ) ; For Ford;For Jaguar\nAsian:\nCompatible with 12V Standard OBD2 Cars from 2005 to Now\nFor KIA; For Isuzu; For Honda; For Mitsubishi; For Hyundai; For Dacia; For Lexus; For Mazda; For Nissan; For Subaru; For Suzuki; For Toyota\nAustralia:\nCompatible with 12V Standard OBD2 Cars from 2004 to Now\nFor Holden; For Ford\n🔔🔔Note: Even though it compatible with most cars, but different regions support the vehicle OBD2 protocol at different times,  so it may not compatible with some cars which do not support OBD2 protocol.If you are not sure whether it is support your car,please offer Car Brand, models and release year to seller to check it for you.\nFor Example : Toyota corolla, 2008，VIN:xxxxxx\n🔔🔔Warning:\nNot Support Russian Cars VAZ, UAZ, LADA ; Not works with trucks\nNot Support for Renault Clio 2/Megane/Dacia Logan etc.\nNot Support for Ssangyong Actyon, from 2009 to 2017 years.\nNot Support for Ssangyong Korando, 2.0 TD Diesel, from 2013 to 2017 years.\nNot Support for Ssangyong Kyron, 2.0 Diesel, from 2010 to 2017 years.\nNot Support for Ssangyong Rexton, 2011 to 2017 years.\nNot Support for Passat 1.9Tdi 2000\n ⭐Package List：\n1PC x Vident iEasy310 pro Scanner\n1PC x USB cable\n1PC x Manual\n   ☑️I/M Readiness One-Key Fast Check\nVident iEasy310Pro car fault code reader designed with 2.8'' TFT color screen, featuring with three color LED Indicators with alarm, One-Click I/M Readiness Quick check the emissions readiness and verification of drive cycle. Detect emission status and READ/CLEAR Trouble Code Hot keys to help you search trouble codes easily.\n☑️ Supports 12V Standard Vehicles Battery Voltage Test\nVIDENT iEASY 310Pro OBDII Code reader car diagnostic tool with reset, which can test and display the voltage of the battery analyze battery healthy status, view charging status, and detect faults and bad cells and give you an accurate test result.\n☑️DTC Lookup & Code Breaker\nEvery code in iEasy310 Pro comes with a description to aid technicians in efficient vehicle diagnostics and repair. This will save you the trouble of having to go online to look for the meaning of a diagnostic trouble code. And you can also simply click on the error code selected so as to get an in-depth definition.\n☑️ Lifetime Free Software Update via USB Connected to PC and Print DTC Data\niEasy310Pro car diagnostic reader provides lifelong free software updates via the Internet. There is no limit to the number of updates and functions. All functions and models are free of charge. The main purpose of the update is to add more models, fix errors, and bring you a better experience\niEasy310Pro Support Print Data From Diagnostic Tool To Computer Which More Convenience For You To View The Data. This Function Allows You To Send The Data To Your Mechanic For Help.\n  ☑️ 4 In 1 Live Data Graph\nReal-Time View of Data Streams Graphing & Logging. Display the real time PID data from ECU (as analog inputs and outputs, digital inputs and outputs, and system status information broadcast on the vehicle data stream). Support Multi- Parameter Display Graphics At the Same Time For Better Analysis of Vehicle Conditions, tells you exactly what you require to know about your vehicle.\n☑️Vident iEasy310Pro OBD2 Scanner is Compatible Multi-Vehicles from the US, Europe, Asia.\nSupported Protocols: J1850-41.6, J1850-10.4, ISO9141, KWP2000 (ISO 14230), and CAN (Control Area Network ISO 11898)\n  ☑️ Vident iEasy310 Pro Support11 Kinds of Languages:  \nEnglish, French, German, Russian, Spanish, Italian, Portuguese, Hungarian, Swedish, Slovak, Czech\n🔔🔔Note:There is no Polish and Netherland language. When you receive, get others languages by update tool.\n ☑️Advance Technical Specifications:\nDisplay: 2.8” LCD color screen   \nOperating Temperature: 0 to 60°C (32 to 140°F)\nStorage Temperature: -20 to 70°C (-4 to 158°F)\nPower: 8-18V Vehicle   \nUnit Dimensions : 14\n7*90*30(mm)  \nWeight: 450g\nPAYMENT\nDELIVERY DETAILS\nRETURN\nABOUT US\nContact us\n1.We accept PayPal payment,PayPal Credit,Credit card or debit card and so on.\n2.Please pay immediately after purchase.\n3.We will leave a positive feedback immediately after payment is received. We appreciate a positive feedback as much as you do. If for some reason there is any issue with the purchase, please contact us prior to leaving feedback, we will be glad to work together and provide a satisfying solution."}
{"itemId": "v1|110554924635|0", "title": "Red & Green Dot Sight Tactical Rifle Scope 4 Reticle Reflex Mount for 20mm Rails", "leafCategoryIds": ["66827"], "categories": [{"categoryId": "66827", "categoryName": "Red Dot & Laser"}, {"categoryId": "888", "categoryName": "Sporting Goods"}, {"categoryId": "7301", "categoryName": "Hunting"}, {"categoryId": "31710", "categoryName": "Scopes, Optics & Lasers"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/YuQAAOSwsFZmML6i/s-l225.jpg"}, "price": {"value": "18.89", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554924635%7C0", "seller": {"username": "testuser_pa4_demo_1", "feedbackPercentage": "100.0", "feedbackScore": 1}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/YuQAAOSwsFZmML6i/s-l1200.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE", "BEST_OFFER"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/Red-Green-Dot-Sight-Tactical-Rifle-Scope-4-Reticle-Reflex-Mount-for-20mm-Rails-/110554924635?hash=item19bd96465b:g:YuQAAOSwsFZmML6i", "itemLocation": {"country": "US"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/tl8AAOSwbdFmML6j/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/coIAAOSwWBZmML6n/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/eMUAAOSwfdRmML6q/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/-qUAAOSwb65mML6u/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/FCMAAOSw67dmML60/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/dqwAAOSwCvxmML61/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/y-MAAOSwE71mML66/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/oA4AAOSw4NBmML67/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/5UMAAOSwiXRmML67/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/2f4AAOSwkeNmML68/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554924635", "availableCoupons": false, "itemCreationDate": "2024-05-07T01:27:01.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "listingMarketplaceId": "EBAY_US", "item_description": "Red & Green Dot Sight Tactical Rifle Scope 4 Reticle Reflex Mount for 20mm Rails\nAbout the Product:\n This red dot sight comes with an integrated mount for standard 20mm rails and is ideal for normal and rapid-firing shooting of moving targets. The tubeless design with 33mm reflex lens aperture provides a wide field of view and the included tools allow you to adjust windage and elevation in the field. It's durable and lightweight with all metal construction that will make the unit last a long time, it's also weatherproof, and shockproof.\n 1.Constructed by aluminum alloy with anodized matte black processing and light weight and compact design, water resistant and shockproof.\n2.Anti-glare reflective coated lenses that gives good optical clarity and tubeless design with 22 x 33mm apertures reflex lens, provides a wide field of view.\n3.A 3-position rheostat illumination(Red and Green) and installed 4 different reticles (Circle Dot, Cross, 10 MOA and 3 MOA) for optimum versatility.\n4.Head screw type windage and elevation click adjustments, with lock screw and with integrated mount 20mm rail.\nSuitable for rapid-firing or shooting of moving targets besides normal shooting and Powered by 1 x lithium CR2032 battery.\n Features:\nTubeless design with 33mm reflex lens aperture provides a wide field of view, suitable for normal and rapid-firing shooting of moving targets\nBuilt with strong aluminum alloy with anodized matte tan finish\nLight weight, Compact design\nWindage and elevation adjustable (tools included)\nRed and green reticles with four patterns\nAdjustable reticle brightness\nLightweight, weatherproof, and shockproof\nIntegrated mount for standard 20mm rails\nAnti-glare reflective coated lens\n \nSpecifications:\nDimensions: 3.35\" (length) x 1.5\" (width) x 2\" (height)\nWeight: 130g (4 oz)\nField of View Unlimited\nReticle Type Circle dot, cross, 10 MOA, and 3 MOA\nColor: Black\nPower: 1 x CR2032A (included)\nMagnification:12x\nScreen Size:22mm x 33mm\nIlluminated:Red, Green / 5 Brightness\nField of View:Unlimited\nEye Relief:Unlimited\nMount:20mm\n Items Included:\nOne (1) holographic scope\nTwo (2) CR2032 batteries (one spare)\nTwo (2) hex wrenches"}
{"itemId": "v1|110554924636|0", "title": "Red & Green Dot Sight Tactical Rifle Scope 4 Reticle Reflex Mount for 20mm Rails", "leafCategoryIds": ["66827"], "categories": [{"categoryId": "66827", "categoryName": "Red Dot & Laser"}, {"categoryId": "888", "categoryName": "Sporting Goods"}, {"categoryId": "7301", "categoryName": "Hunting"}, {"categoryId": "31710", "categoryName": "Scopes, Optics & Lasers"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/YuQAAOSwsFZmML6i/s-l225.jpg"}, "price": {"value": "18.89", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554924636%7C0", "seller": {"username": "testuser_pa4_demo_2", "feedbackPercentage": "0.0", "feedbackScore": 500}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/YuQAAOSwsFZmML6i/s-l1200.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE", "BEST_OFFER"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/Red-Green-Dot-Sight-Tactical-Rifle-Scope-4-Reticle-Reflex-Mount-for-20mm-Rails-/110554924636?hash=item19bd96465c:g:YuQAAOSwsFZmML6i", "itemLocation": {"country": "US"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/tl8AAOSwbdFmML6j/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/coIAAOSwWBZmML6n/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/eMUAAOSwfdRmML6q/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/-qUAAOSwb65mML6u/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/FCMAAOSw67dmML60/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/dqwAAOSwCvxmML61/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/y-MAAOSwE71mML66/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/oA4AAOSw4NBmML67/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/5UMAAOSwiXRmML67/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/2f4AAOSwkeNmML68/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554924636", "availableCoupons": false, "itemCreationDate": "2024-05-07T01:28:02.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "listingMarketplaceId": "EBAY_US", "item_description": "Red & Green Dot Sight Tactical Rifle Scope 4 Reticle Reflex Mount for 20mm Rails\nAbout the Product:\n This red dot sight comes with an integrated mount for standard 20mm rails and is ideal for normal and rapid-firing shooting of moving targets. The tubeless design with 33mm reflex lens aperture provides a wide field of view and the included tools allow you to adjust windage and elevation in the field. It's durable and lightweight with all metal construction that will make the unit last a long time, it's also weatherproof, and shockproof.\n 1.Constructed by aluminum alloy with anodized matte black processing and light weight and compact design, water resistant and shockproof.\n2.Anti-glare reflective coated lenses that gives good optical clarity and tubeless design with 22 x 33mm apertures reflex lens, provides a wide field of view.\n3.A 3-position rheostat illumination(Red and Green) and installed 4 different reticles (Circle Dot, Cross, 10 MOA and 3 MOA) for optimum versatility.\n4.Head screw type windage and elevation click adjustments, with lock screw and with integrated mount 20mm rail.\nSuitable for rapid-firing or shooting of moving targets besides normal shooting and Powered by 1 x lithium CR2032 battery.\n Features:\nTubeless design with 33mm reflex lens aperture provides a wide field of view, suitable for normal and rapid-firing shooting of moving targets\nBuilt with strong aluminum alloy with anodized matte tan finish\nLight weight, Compact design\nWindage and elevation adjustable (tools included)\nRed and green reticles with four patterns\nAdjustable reticle brightness\nLightweight, weatherproof, and shockproof\nIntegrated mount for standard 20mm rails\nAnti-glare reflective coated lens\n \nSpecifications:\nDimensions: 3.35\" (length) x 1.5\" (width) x 2\" (height)\nWeight: 130g (4 oz)\nField of View Unlimited\nReticle Type Circle dot, cross, 10 MOA, and 3 MOA\nColor: Black\nPower: 1 x CR2032A (included)\nMagnification:12x\nScreen Size:22mm x 33mm\nIlluminated:Red, Green / 5 Brightness\nField of View:Unlimited\nEye Relief:Unlimited\nMount:20mm\n Items Included:\nOne (1) holographic scope\nTwo (2) CR2032 batteries (one spare)\nTwo (2) hex wrenches"}
{"itemId": "v1|110554962602|410109463715", "title": "Projector Galaxy Starry Sky Night Light Party LED Lamp Remote Control Aurora USB", "itemGroupHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/get_items_by_item_group?item_group_id=110554962602", "leafCategoryIds": ["20702"], "categories": [{"categoryId": "20702", "categoryName": "Night Lights"}, {"categoryId": "11700", "categoryName": "Home & Garden"}, {"categoryId": "20697", "categoryName": "Lamps, Lighting & Ceiling Fans"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/AdgAAOSwFlNmTrTi/s-l225.jpg"}, "price": {"value": "12.49", "currency": "USD"}, "itemGroupType": "SELLER_DEFINED_VARIATIONS", "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554962602%7C410109463715", "seller": {"username": "testuser_pa4_demo_2", "feedbackPercentage": "0.0", "feedbackScore": 500}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/AdgAAOSwFlNmTrTi/s-l1200.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/Projector-Galaxy-Starry-Sky-Night-Light-Party-LED-Lamp-Remote-Control-Aurora-USB-/110554962602?hash=item19bd96daaa:g:AdgAAOSwFlNmTrTi", "itemLocation": {"postalCode": "******", "country": "CN"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/85kAAOSwOz9mTrJT/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/F-8AAOSwrY1mTrJU/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/Ig0AAOSwryxmTrJV/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/IsYAAOSwgehmTrJW/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/E8EAAOSw9D1mTrJW/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/9BUAAOSwFL1mTrJX/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/0tsAAOSwwQxmTrJY/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/jXoAAOSwGEVmTrJZ/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/wHUAAOSwQyVmTrJa/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/p34AAOSwSfhmTrJb/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/uK4AAOSwfYFmTrJc/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/EkcAAOSwHHJmTrJc/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/95QAAOSwFpNmTrJd/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/X~kAAOSwy79mTrJe/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554962602", "availableCoupons": false, "itemCreationDate": "2024-05-23T03:46:19.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "listingMarketplaceId": "EBAY_US", "item_description": "Projector Galaxy Starry Sky Night Light Party LED Lamp Remote Control Aurora USB\nDescription:\nProduct Name: Projection lamp\nInput voltage: USB 5V\nRated Power: MAX 5W\nLamp Source: LED R G B\nProduct material: ABS+PC\nFunction mode: Auto remote control\n Feature:\n\n【 Stunning Visual Effects 】This Northern Lights Projector lets you enjoy the beauty of nature in your own room, creating a relaxing atmosphere by projecting colorful lighting effects.\n【 Music-Responsive Projector Light 】This Northern Lights Projector can adjust the projection with music, creating a vibrant and lively party ambiance. The lights will match the rhythm and delight your guests.\n【 Spectacular Light Effects 】Experience the wonder of the ocean or the starry sky with 14 diverse light effects that recreate the natural scenes. You can adjust the light color and speed to match your mood and immerse yourself in the soothing atmosphere.\n【 Simple to Operation 】Manage the projector with a gentle touch - The remote control allows you to turn on/off the projector, choose the lighting mode and speed, and change the brightness with convenience. You can create a calming and romantic setting in your bedroom.\n【Wonderful Room Decor 】This projector creates an enchanting ambiance of northern lights in your game room, home theater, or kids room. It's wonderful to celebrate Christmas parties, weddings, birthdays, and anniversaries.\n【 Suitable for Kids to Sleep 】Get closer to the stars, quiet and smart, and give your child a good night's rest with this night light for kid's room. What is more, it can help parents coax the baby to sweet sleep.\n【 Multifunctional 】 When you use it as a night light , you need to cover the acrylic shade, Removing the shade, the light can be used as a projector.\n【 Perfect Gifts 】It will be best gift for christmas, birthdays, baby showers. Your friends and loved ones absolutely appreciate the night light projector. Use this unique, useful and multi-purpose lamp as a gift idea for the times when you are hard pressed for ideas.\n Packing Included:\n1 x Projection lamp\n1 x USB charging cable\n1 x Remote control(NOT included the battery )\n  Note:\nThe color deviation is subject to actual system configuration and 1-3cm slight dimension difference is allowed due to manual measurement. Please refer to the size chart based on your actual figure\nPeople who undertake the installation,operation and maintenance,must be familiarwith the lighting Performance.Damage may result from misuse.\nDon't face up to the luminous for a long time,avoid discomfort to your eyes\nPayment\nDelivery details\nReturns\nAbout us\nContact us\n1.Paypal, Credit Card, G Pay etc, many payment way is accepted.\n2.Please be sure your shipping address is correct before make a payment."}
{"itemId": "v1|110554947533|0", "title": "Carpuride W702 Apple Carplay Android Auto Waterproof Touchscreen Dual Bluetooth", "leafCategoryIds": ["174119"], "categories": [{"categoryId": "174119", "categoryName": "Car Stereos & Head Units"}, {"categoryId": "171101", "categoryName": "In-Car Entertainment"}, {"categoryId": "6000", "categoryName": "eBay Motors"}, {"categoryId": "6028", "categoryName": "Parts & Accessories"}, {"categoryId": "38635", "categoryName": "In-Car Technology, GPS & Security"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/GuIAAOSwEPxmHhj6/s-l225.jpg"}, "price": {"value": "239.99", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554947533%7C0", "seller": {"username": "testuser_pa4_demo_4", "feedbackPercentage": "0.0", "feedbackScore": 500}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/GuIAAOSwEPxmHhj6/s-l1200.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE", "BEST_OFFER"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/Carpuride-W702-Apple-Carplay-Android-Auto-Waterproof-Touchscreen-Dual-Bluetooth-/110554947533?hash=item19bd969fcd:g:GuIAAOSwEPxmHhj6", "itemLocation": {"city": "Los Angeles", "postalCode": "900**", "country": "US"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/eTQAAOSwzTVlXxtl/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/LY0AAOSwxdxlXxtZ/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/R3kAAOSwBaFlXxtk/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/fuAAAOSwpG5lXxtk/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/hlcAAOSwljllXxtj/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/E90AAOSwJCZlXxtZ/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/F1sAAOSwdgxlXxtk/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/b98AAOSwRjBlXxtk/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/pRIAAOSwKlllXxtj/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/IroAAOSwGVRlXxtZ/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/Z1YAAOSweIplXxtZ/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/IfEAAOSwPkVlk4pE/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554947533", "availableCoupons": false, "itemCreationDate": "2024-05-16T07:07:58.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "item_description": "Carpuride W702 Apple Carplay Android Auto Waterproof Touchscreen Dual Bluetooth\n\n【Wireless CarPlay and Android Auto for Motorcycles】: Our carpuride W702 motorcycle carpaly has CarPlay or Android Auto functionality. By wirelessly connecting your smartphone to your motorcycle's touchscreen via Bluetooth, you can access map navigation, phone calls, music playback, text messaging, and more with the help of Siri or G00gle Assistant. Keeping your hands free allows you to focus on the road and ride safely.\n【Built-in Dual Bluetooth】: Carpuride W702 Motorcycle GPS carplay features built-in Dual Bluetooth connectivity, pair the carplay touch screen with your smartphone and Bluetooth-enabled headphones or helmet, you can make hands-free calls or enjoy your favorite music, without take off your helmet. The convenience of dual Bluetooth seamless connection not only keeps your phone safely in your pocket but also allows you to enjoy a free riding experience.\n【7\" HD IPS Touch Screen】: The carplay screen for motorcycle is equipped with a 7-inch high-definition IPS touch screen with a resolution of 1024*600, making the visual effect more intuitive and the touch responsive. Vibrant 65K color and up to 1000nit peak brightness ，provide a clear and wonderful viewing experience even under bright outdoor sunlight, and include 64G TF cards.\n【IP67 Waterproof & Anti-Theft Design】: IP67 Waterproof and Durable design, even if you ride in the rain or scorching sun, our motorcycle carplay screen can still be used normally, no need to worry about all kinds of weather! The Thief-proof detachable bracket design keeps the motorbike touch screen under control, providing you with higher security and convenience. It works flawlessly in a temperature range of -20°C to 70°C.\n【Built-in EQ 】With its built-in preset EQ and user-customized 16-band HD EQ with 12 adjustable frequency sections, you can enjoy a wide variety of music styles and sound effects. when playing music through SD, and Bluetooth Music, click EQ,open or close \"Loud\" to turn on/off the bass effect, you can also choose the sound effect mode, rock, classical, jazz,and other sound effects.\n【Two Power Connection Options】Using the motorcycle power line to provide 12V and 1A to the battery. The motorcycle's USB port provides a current of 5V and 2.5A or higher, use the USB boost cable to directly connect the W702 device to the motorcycle's USB port. The W702 has built-in reverse protection for convenience. Even if the cable is connected incorrectly, the device will not be damaged.\n【Easy Installation, Suitable for All Motorcycles】: This portable motorcycle car screen comes with a bracket kit and tools for easy installation. Specially designed bracket kit and screw system with a safe and stable setup makes it easy to securely mount the screen on any motorcycle; (Simple wiring, ACC +12V and ground), NOTE: Not perfectly compatible with Samsung Note as well as S series. Before buy, please make sure your phone supports wireless carplay or wireless android auto.\n【Customer Service & Products Included】: Carpuride customer service team will provide you with satisfactory after-sales service, if you have any problems in the process of using, please contact us by email or call the US customer service number, we will have professional staff to help you solve the problems. Products Included: 1x 7 inch Motorcycle carplay screen ,1x Power line, 1X USB Boost Cable,1x U-shaped Support, 1X64G TF, 1x Extension Rod, 1x User manual.\n【Notice】: The accessory 64GTF card does not support software upgrades. It only supports storing music and videos for local playback. If you want to update software, please use a small capacity 32, 16, 8, 4GB card.\n【Notice】: When using the motorcycle power line to supply power to the battery, ensure that the output voltage and current are 12V, 1A. If the USB port on the motorcycle outputs voltage and current less than 5V, 2A, it is not recommended to use the Carpuride moto to connect the USB boost line, as insufficient voltage or current may cause the motorcycle carplay screen to automatically shut down.\n\n\nUse your iPhone or Android Smartphone, easily connected to our Carpuride Motorcycle Carpaly Screen via Bluetooth, you can not only enjoy music, making phone calls, but also stay focused on ride, Keep you ride safely and happily on the road！\n\nWireless CarPlay & Android Auto\n\nCompatible with Wireless Apple CarPlay Compatible with Wireless Android Auto\nThe Motorcycle Carpaly support IOS system: Connect to your iPhone via Bluetooth wireless conenction, you easy to access your iPhone apps and features .With help of smart Siri voice assistant, you can make hands-free calls, play music, map navigation, and much more. The Motorcycle Carpaly support Android System: Connect to your phone via Bluetooth wireless conenction , allowing you easy to access your Android phone apps and features .With help of g00gle assistant, you can make hands-free calls, enjoy music, send and receive messages, map navigation.\n\n\nHow To Set Up Helmet and Headset ?\n\n\nPair your phone to the Motorcycle carplay screen via Bluetooth, pair the unit to your Bluetooth helmet/earphone, then you can adjust the volume and make hands-free calls by your helmet or earphone. Enjoy the freedom of seamless connectivity and enhanced functionality while riding.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDelivery details\nAbout us\nReturn Policy\nPayment\nContact us\nWe would ship out the item within 1-2 business days after the payment is received. We will test goods carefully before ship out.\nThe package will be ship from California warehouse.The items will arrrive to you about 2-4 days in normal conditions.\nWe only ship to the confirmed address provided. Before you pay, please make sure the address you would like us to ship to.\nTo ship an item ,we must have your correct telephone number and address for express delivery to your home."}
{"itemId": "v1|110554926327|0", "title": "Portable Air Compressor Pump 12V 150PSI Dual Cylinder Tire InflatorTire Inflator", "leafCategoryIds": ["35000"], "categories": [{"categoryId": "35000", "categoryName": "Power Tools"}, {"categoryId": "6000", "categoryName": "eBay Motors"}, {"categoryId": "34998", "categoryName": "Automotive Tools & Supplies"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/0VAAAOSwv4RmOxi4/s-l225.jpg"}, "price": {"value": "59.99", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554926327%7C0", "seller": {"username": "testuser_pa4_demo_4", "feedbackPercentage": "0.0", "feedbackScore": 500}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/0VAAAOSwv4RmOxi4/s-l1200.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE", "BEST_OFFER"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/Portable-Air-Compressor-Pump-12V-150PSI-Dual-Cylinder-Tire-InflatorTire-Inflator-/110554926327?hash=item19bd964cf7:g:0VAAAOSwv4RmOxi4", "itemLocation": {"country": "US"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/UGgAAOSwcYRl6arr/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/xaIAAOSw89pl6arr/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/JkIAAOSwCv9l6arr/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/biIAAOSwIvdl6arr/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/ZQsAAOSwxMhl6arw/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/w9sAAOSwvJ1l6arq/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/B4gAAOSwzuFl6arr/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/kvMAAOSw3ytl6arr/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/oRYAAOSwQ-ZmOxi5/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/0WUAAOSwCJdmOxi5/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/0VEAAOSwv4RmOxi5/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/oRwAAOSw9xtmOxi6/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554926327", "availableCoupons": false, "itemCreationDate": "2024-05-08T06:16:30.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "item_description": "Portable Electric Air Compressor Pump,Heavy Duty Double Cylinder Tire Inflator with Gauge and Universal for Car Truck Bicycle Basketballs Other Inflatables, ABS 12V 200W 150PSI\nDescription:\n1. EMERGENCY TIRE PUMP: This quality portable car compressor makes inflating your tires fast and easy. Bimetal piston shaft, stainless steel shrapnel gas valve, self penetration solid lubricant. Only takes 2-4 mins to reach the normal tire pressure, giving\nfull play to the characteristics of high-speed, large-capacity, powerful performance.\n2. ALL PURPOSE NOZZLES & ATTACHMENTS: Inflate anything with a tire nozzle, extension nozzle and pin needle. From air mattresses, balls, beach toys, to all kinds of tires: bike, stroller, car wheels, SUVs, trucks, vans, RVs, crossovers, MPVs, campers,\ntrailers, minivans, to cars, motorcycles, golf carts, bicycles and so on.\n3. PACKAGE INCLUDING: A Heavy Duty Double Cylinder Tire Inflator Pump with Pressure Gauge, Power Cord With Battery Clamps, 3m Air Hose, Inflatable Adapters and LED work light for pumping at night or in dark areas, and a handy carrying bag.\nFeature:\nItem:Portable Tire Inflator Air Pump\nMaterial: Metal+ Plastic\nColor: Black & Silver\nSize(L*W*H): 24.5x9x14.5cm/ 9.65x3.54x5.71\"\nVoltage: DC 12V-13.8V\nMax.Amperage: 23Amp\nFiow rate@OPSI(13.8 Volts): 1.94CFM\nMax.Duty Cycle(@23 C & 150PSI): 20%\nAir Pressure:150 Psi\nAir flow: 60L/min\nCurrent: 22A\nWorking Temp:-55℃ to 60 ℃\nContinuity Working Period:30mins /40PSI /24℃\nCertification:CE Certification\nPackaged included:\n1x Tire Inflator Pump\n1x 3m Air Hose\n1x Coiled Hose\n1x Battery Clamps pair\n3x Nozzle Adaptors\n1x Black Carry Bag\n1x Use Manuel\nNotes:\n1.The normal tire can reach 2.5KG normal tire pressure in about 2-4 minutes when it is inflated. Big tires will take longer. At the beginning of inflation, the indicator rises to 50-100PSI rapidly, which means that the air has not filled the tire, must\nstop working, re-operation, otherwise, the instrument and motor will be damaged.\n2. In order to extend the life of the Tire Inflator, please do not continue to work for more than 20 minutes, avoid damage to the fuse in the cigarette lighter due to excessive temperature. Our recommendation is to cool for 5-10 minutes after 20 minutes\nof work and continue working."}
{"itemId": "v1|110554939304|0", "title": "2024 LAUNCH CRP123X V2.0 OBD2 4 Systems Diagnostic Scanner Tool Engine ABS SRS", "leafCategoryIds": ["179476"], "categories": [{"categoryId": "179476", "categoryName": "Code Readers & Scanners"}, {"categoryId": "6000", "categoryName": "eBay Motors"}, {"categoryId": "34998", "categoryName": "Automotive Tools & Supplies"}, {"categoryId": "179474", "categoryName": "Diagnostic Service Tools"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/MEEAAOSwFcJmQtFg/s-l225.jpg"}, "price": {"value": "169.00", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554939304%7C0", "seller": {"username": "testuser_pa4_demo_6", "feedbackPercentage": "0.0", "feedbackScore": 500}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/MEEAAOSwFcJmQtFg/s-l1200.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE", "BEST_OFFER"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/2024-LAUNCH-CRP123X-V2-0-OBD2-4-Systems-Diagnostic-Scanner-Tool-Engine-ABS-SRS-/110554939304?hash=item19bd967fa8:g:MEEAAOSwFcJmQtFg", "itemLocation": {"city": "Perth Amboy", "postalCode": "088**", "country": "US"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/IiwAAOSwk8Bj3HWY/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/oTgAAOSw-Rxj3HWV/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/EKQAAOSwz8djEBJ4/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/hZEAAOSwTnpjEBJ5/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/vogAAOSwoJNjEBJ6/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/5AwAAOSwSzJjEBJ7/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/rUYAAOSw1pBjEBJ8/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/rF4AAOSwGnFjEBJ9/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/PlcAAOSwUe1jEBJ-/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/i-sAAOSwREZj3HWX/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/waoAAOSw48pj3HWY/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554939304", "availableCoupons": false, "itemCreationDate": "2024-05-14T02:51:43.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "item_description": "2024 LAUNCH CRP123X V2.0 OBD2 4 Systems Diagnostic Scanner Tool Engine ABS SRS\n2024 Newest LAUNCH CRP123X V2.0 OBD2 Scanner, Lifetime Free Update Car Scanner with ABS Bleeding/SAS/Throttle/Oil/D.P.F/EPB Reset, BAT Match, ABS SRS Transmission Engine Code Reader Scanner, Auto VIN\nAbout this item\n🎁【Free TPMS Activation Tool】 \n【Newest Upgrade! 2024 OE-LEVEL Car Scanner】Upgrade Model of CRP123E&I! 4X Faster of CRP123* ! Smarter!More Stable! CRP123X V2.0 automotive scanner has been upgraded(Added 4 Reset functions)➤ Brand New Upgrade Qualcomm Snapdragon Chip➤4 System Diagnose➤7 Service Functions(Upgrade)➤Android 8.1➤32GB RAM➤5\" Touchscreen(1280P * 720P) ➤6100mAh Battery➤One-touch Wi-Fi Free Lifetime Updates ➤ Cover Newer Vehicles➤Fix Bugs➤ Add New Parameters and Features to Access, Diagnose, and Fix Vehicles Faster➤ Work Out Of Box➤ Five Year W-arranty➤Same as CRP129X,Lower cost and Better value for money\n 【7 Reset Functions+DTC Help】Special features added to the latest CRP123X V2 .0 Elite scan tool for 2023 - Throttle Adaptive, Oil Reset, SAS Reset, EPB Reset, ABS Bleeding, Battery Match, D.P.F Reset. Before going to the garage, the CRP123X Elite is introduced to provide more in-depth diagnosis of the car system and react to the accurate data in minutes.Also，DTC help also provides appropriate help and advice according to the error codes, which is enough to satisfy your daily maintenance needs!\n 【Accurate & Intuitive Multi-System Diagnosis】The Launch CRP123X V2.0 diagnostic tool can pinpoint the problem components when warning lights flash for the transmission, ABS, Engine and SRS airbag check engine.,whick makes for a faster diagnosis and helps car owners avoid trips to the dealership\n 【Wider Vehicle Coverage From 1996 To 2024,No IP Limit】CRP123X V2.0 supports Diesel (12v only), 12V Passenger car, Hybrid car，Pickup, and Light-duty Truck,SUV,Gasoline,Minivans,Caravan,Van from 1996-2024, covers OBD2/ EOBD/KOBD&CAN protocols: VW,Acura, Alfa Romeo, Audi, Bentley, Benz, BMW,, Bugatti, Buick, Cadillac, Chevrolet, Chrysler, Citroen, Dacia, Daewoo,Dodge, Fiat,Ford,Faking, GM, Honda, Hyundai, Infiniti, Isuzu,Jaguar, Jeep,KIA,Lancia, Land Rover, Lexus,Lincoln,Maybach, Mazda, Nissan,Porsc,etc.\n 【Multiple Live Data Stream Graph+ Battery Voltage Checker】 Launch CRP123X V2.0 car tools shows real-time data of oil temp, pressure, transmission temp, engine speed, coolant temperature. Data can be shown in a single, multi- graph, and merge two graphs for analysis（merge 4 PIDs in one). The Launch CRP123X scanner can monitor a vehicle’s battery voltage and informe you of the health of your battery.\n 【Auto-VIN Smart Diagnostic & Online Feedback & Health Report Printer and Share & 11 Languages Support】Launch CRP123X V2.0 scan tool auto-vin technology allows you to get your VIN and vehicle info rapidly (vehicle make, model, and year info), no need to take time to find your VIN and input one by one (Some models need to type it in manually.)Vehicle Health Report can be recorded and playback for further analysis, launch car scanner can be shared by email and then print on a computer.\n 【60-dayFree Return Policy & 5-Year-*Warranty&U.S. T.ech Su.pport 】CRP123X V2.0 offers a 60-day return policy and 5 years of technical support so you can shop with confidence. As a car diagnostic strength seller with 20 years of experience, we have set up overseas repair centers overseas to serve customers in the last mile, U.S. worry-free after-sales Su.pport!\nProduct Description\nBig Upgrade!!!✔️ FASTER, ✔️SMARTER,✔️MORE STABLE✔️MORE POWERFUL✔️MORE NEWER VEHICLE COVERAGE✔️MORE POPULAR ✔️NO IP LIMIT✔️Newest Process\n\nWhy Launch CRP123X V2.0 Elite Can Be Your First Choice(5 Year W-arran-ty, Lifetime Free Update)\nWider Vehicle Coverage for 1996-2024 vehicles across the global(e.g. America: GM/ Ford/ Chrysler,etc; Europe: Audi/VW/ Benz/ BMW/ Fiat/Porshe,etc; Asia: Toyota/ Honda/ Nissan/ Hyundai / Kia),etc. 2024 Elite Version, Compatible with OBD2/EOBD/JOBD&CAN protocols and the data upgrade new makes up to 2024 models, including diesel cars(only 12V） 12V passenger cars, SUVs, minvans, hybrid cars, light-duty trucks,pickup,gasoline, Minivans and Caravan, Van etc.Check compatibility before order.\n4 Systems Diagnostic with deep inspection for Engine/ABS/SRS(AIRBAG)/Transmission systems for a health diagnostic, retrieve ECU information, read/ erase codes, turn off warning lights.Same as LAUNCH CRP129X.\n7 Hot Services Functions: (1)Oil Reset,(2) SAS Calibration, (3)Throttle Adaption,(4)EPB Reset,(5) D.P.F Reset (6) ABS Bleeding (7)BMS Reset; 7 Service maintaining your vehicle system safely and efficiently, without any fee & continuous growth.\nEasy to Diagnose with DTC Help&Code Search:When CRP123X scans error codes, DTC Help can define the code and give the appropriate explanation and repair guidance advise through Google search.And there is no need to update or download any APP before use.\nGoogle Online Code Search: This provides you with a direct path to extensive online code resources and swift issue resolution.\nStronger and More Resistant to Fall. The anti-slip handle design and anti-fall shell greatly extend the lifetime of the launch scanner.\nFull 10 OBD2 Tests Modes works on most OBD2/EOBD/KOBD/CAN standards vehicles made from 1996 to 2024. Support for all 10 test modes of OBDII with Enhanced OBDII Mode 6 - View freeze frame data and I/M Readiness monitor status..\nSmart Diagnosis (Auto-Detect) Auto identify the Auto VIN(CIN/VIN/CVN), read version information of ECU.\nHealth ReportPrinter & Share via Email. Diagnostic Online Feedback, DTC LookUp Library.\nIntuitive Data Analysis: 1.displays live data in text and 4-in-1 merged graphs for easy data review and analysis; 2.Record and Playback test results with one touch; 3.Prints out Diagnostic Report anytime with easy connection to a Windows PC.\nWork Out of Box: CRP123X V 2.0 can be activated automatically by connecting to WIFI without registering manually, which is very friendly for beginners.\nHigh-end Hardware Configuration: Powered by Android 8.1 OS and newly developed chips, 2024 ver, 5” touchable LCD with easy-to-read 1280*720P clarity. LAUNCH CRP123X V 2.0 scanner brings 4x faster stable processing speed and powerful diagnostic capability. the storage enhanced from 16G to 32GB, and the running memory up to 1.4Ghz. 6100mAh built-in chargeable battery supplies a constant flow of energy and mobile diagnostic way, no worry for power consumption.11 Languages Support: English, French, Spanish, German, Korean, Japanese, Portuguese, Italian, Traditional Chinese, Russian.Real Time Battery Voltage Monitor to check vehicle battery voltage status in real time.One-Click update via WiFi. Don't worry about missing the latest model coverage and new addly functions.User-Friendly design& Easy to Use: CRP123X Elite code scanner can be used out of box and no need to finish the update first. No need battery and software installation before the use.\n>>>>Perfect accessories fr.ee replacement s.ervice: If you use CRP123X process, lost accessories, such as USB charging cable, OBD2 plug, please c.ontact us, we will give you fr.ee replacement accessories, don't worry about accessories a.fter-sales problems, within five days can be delivered to the customer's shipping address!\n>>>>5-year-w.arranty: As long as you buy our LAUNCH CRP123X, we will provide five-year w.arranty service for the products generated within the order, such as CRP123X v2.0, OBD2 connector, USB charging cable, etc., and we will be responsible for all the problems generated within five years! Any Issue ,e mail or c a l l us directly : 323- 325-5773 ([email removed by eBay]). n ow ,Choose any 2pcs Christmas gifts from EL-50448 TPMS tool/YA201 obd2 scanner/ OBDII Extention cable\n2024 Newest Version LAUNCH CRP123X SCANNER TOOL for ENGINE /ABS /SRS /TRANSMISSION\n\nEssential 4 System Engine/ABS/SRS/Transimission Scan Tool to Get Root of The Case in Seconds(Same as CRP129X)\n>> What can CRP123X V 2.0 do for 4 Syetems Diagnostic:\n For Anti-L ock Braking System(ABS System): CRP123X scan tool with auto abs bleeding can prevent kidding and allows to keep steering control on the ABS Bleeding System.For the safety of your family, please pay attention to the health of the brake system. Launch CRP123X can help you find problems in time and repair the brake pads in time,etc.\nFor Supplemental Restraint System(SRS System): The SRS system in good condition can provide soft cushioning and restraint for the drivers and passengers in a crash, reducing injuries.CRP123X scan tool can find out the problem of airbag in time and repair it in time. The service life of airbag can be extended,etc. Improve vehicle safety\nFor Transmission system: The transmission system provides the right amount of power and speed to the wheels to make sure the car runs smoothly on the road.The consequence of not paying attention to the gearbox problem is that it needs a lot of maintenance cost. Launch CRP123X helps you repair the gearbox and diangose trans temp in time, saving time and cost,etc.\nFor Engine System: When the check engine light pops on the car dashboard, there is something wrong with the engine, and then the car’s running will be limited and emission-related issues may be affected.It is not only engine system, but also covers 10obd2 mode, which can quickly and accurately locate faults and solve them easily.CRP123X can help you find the root of Case,etc.\n Code Search, DTC Help, Google Search,Online Feedback, 4-in-1 Real-time Data in Text & Graph for ABS/SRS/Tranmission/Engine Syetem, Battery Voltage Monitoring, etc. Each plays an important role in the diagnostic process. Wait for more exploring.\n>>When you need one CRP123X V 2.0 car diagnostic tool?\n Do you know the specific problem of your car before taking it to the auto repair shop? If not, launch CRP123X V 2.0 car scanner can help you.\nDo you want to save time and money in diagnosis and repair? If yes, we recommend the automotive diagnostic tool launch CRP123X to you .\n 7 Most Common Service Functions to Use for Meeting Daily Cars Maintenance Service\n\n7 Host Service Functions to Use for Lifetime Free & Full OBD2 Functions for1996-2024 Cars Make(Upgrade to 7 Rest Functions)\n>>3 Hot Reset Service\nWhen you want to turn off the oil lamp, reset the mileage or drive time? Try Oil Reset by LAUNCH CRP123X V 2.0.\n When the service lamp is on, you can reset the driving mileage or driving time to turn off the service lamp and the system will enable the new service cycle.If the car changs engine oil or electric appliances that monitor oil life, then you need to reset the service lamp.\n When you want to reset the steering angle position sensor? Try Steering Angle Calibration by LAUNCH CRP123X V2.0.\n When you want to reset the steering angle, first you should find the relative zero-point position for the car to drive in a straight line. Taking the position as a reference, the ECU can calculate the accurate angle for left and right steering.After replacing the steering angle position sensor, replace steering mechanical parts (such as the steering gearbox, steering column, end tie rod, and steering knuckle.\n When throttle assembly is replaced and needs a reset? Let’s See How Electronic Throttle Position Reset / Learn of CRP123X will Help You.\n The ECU is replaced and the ECU does not yet store throttle working features.The ECU is disconnected from power and the ECU memory is lost.\n The throttle assembly is replaced.And the intake pipe is replaced or removed, which affects idle speed control by ECU and the throttle body.The throttle is cleaned. Although the idle throttle potentiometer features remain unchanged, with the same throttle opening, the air inflow has changed and idle speed control features have changed.\n>>Added 4 Reset Functions:\n1. D.P.F regeneration may be performed in the following cases: 1. The exhaust back pressure sensor is replaced. 2. The PM trap is removed or replaced. 3. The fuel additive nozzle is removed or replaced. 4. The catalytic oxidizer is removed or replaced. 5. The DPF regeneration MIL is on and maintenance is performed. 6. The DPF regeneration control module is replaced.\n2. When would you use ABS Bleeding ?Exhausting air from the ABS system is important for maintaining proper brake performance.\n3. Battery matching must be performed in the following cases: 1. Main battery is replaced. 2. Battery monitoring sensor is replaced.\n4.When SAS Reset will be used:After replacing the steering angle position sensor, steering mechanical parts (such as steering gearbox, steering column, end tie rod, steering knuckle), performing four-wheel alignment, or recovering the car body, use CRP129I to reset the steering angle.\n>> Full OBD2 Functions - 10 OBDII Test Modes for 1996-2024 Cars Make\n1.Read and Clear DTCs; 2.Turn-off Malfunction Indicator Light (MIL); 3.Read I/M Readiness Status;4. Read Live Data Stream5.Read Freeze Frame Data; 6. O2 Sensor Test; 7.On-Board Monitor Test ; 8. Read Vehicle Information; 9. EVAP Test\n\nONE-Click Lifetime Free WiFi Update: Unlike those tedious upgrade steps that require a computer connection, CRP123X can use just one-click to update via wifi, you can always enjoy more features, newer vehicles, and better performance,no worry about updates.\nAuto VIN: With the latest Auto VIN Scan Technology, LAUNCH scanner CRP123X can quickly automatic identify vehicle information, like brand, year, make, model and etc. NOTE: AutoVIN feature does NOT work on ALL vehicles. You always can navigate your vehicle manually to perform diagnostics/services.\n4-IN-1 Live Data Stream Analyse in Graph:The scan tool CRP123X allows you live sensors data and provides data graphing for intuitive diagnostics and monitoring your vehicle performance, help customers to better analyze the abnormal parameter. Data recording functionality is amazing, customer can record the live data stream for up to 10, simultaneous, PID's. Once these have been recorded they can be played back in text format and/or graph format. Playback supports two graphs (independent) or 4 PID's graphed (combined). Playback timeline can be scrolled, paused, viewed, etc.\nReal-time Voltage Monitoring:Faulty charging system will lead the car out of work. LAUNCH CRP123X adds Real-Time Battery Monitoring, allowing you monitor vehicle battery voltage automatically with reliable real-time graph data. It helps you to determine the battery's health status, get early warnings for possible battery and the charging system's problem.\nOne-Click Generate Health Report:Health Report will scan all vehicle modules and give you a status list for each modules condition .This diagnostic tool can automatically generate a diagnostic report when diagnostic work is successfully finished.The reports are saved to the internal memory for later review. The reports are able to be saved in P DF format, and as the tablet is equipped with WIFI, these can be emailed to the office or directly to the customer.\nOne to One Online Feedback- In-Time Problem Solving:LAUNCH CRP123X Scanner provides you with a Feedback function to share any problems you encounter in the process of diagnosis. We will make every effort to perform a no-delay problem solving and makes improvements on product quality according to your problems and suggestions, thus offering you a higher quality user experience.\nDTC Help+ DTC Library Lookup+Google Search:The built-in DTC library allows you to retrieve the definition of the diagnostic trouble code. Saves your effort in Google searching.DTC help can give relevant guidance to save you time and money.\nView Diagnostic History:Once a vehicle diagnosis is performed, LAUNCH OBD2 SCANNER will record the every detail of the diagnostic process. The History function provides quick access to the tested vehicles and users can resume from the last operation, without the necessity of starting from scratch.\n\n>> Support 57+ Car Makers and Over 100000 Car Model ( Free to Use )\n LAUNCH scanner CRP123X is compatible with most OBD2 compliant vehicles after 1996 regardless of the origin. As a 4 systems diagnostic tool, CRP123X supports 57+ car makers and over 1000+ models, including popular cars from Europe, Asia and US. It is worth mentioning that you will keep getting newer models through the online update,and vehicle models, saving your money without extra charges. This function is super helpful, especially for local dealers to win more businesses. (Note: Reach us to check compatible before purchase)\n >> 11 Languages to Use\n LAUNCH CRP123Xcode reader supports English, Spanish, French, German, Italian, Polish, Japanese, Chinese and Korean. Choosing your native language without any sort of language barrier.Easily change language in Setting menu.\n >> MALL Service\n Since the upgrade in 2024, you can subscribe the full functions (single brand) in the Mall to know \"exactly\" what is wrong with your vehicle and fix the issue immediately. Full function(single brand) , same as X431 series function, can support a lot of OEM advanced functions, such as full system diagnosis, bidirectional control, reset function, ECU coding and ect. The data shows that more than 35% of customers are willing to purchase full function to enjoy a better experience. Note: Check compatibility before purchasing.\n >> What You Will Get in Your Box?\n Creader Professional 123I Handset\nOBD II diagnostic cable\nDC 5V charging cable\nUser manual\nCarrying bag\n1 * GLFT : TPMS EL-50448 Activation Tool（just click \"Extra Savings\" and add it）\n \nWhy Choose CRP123X:Twenty Years of Auto Industrial Technology and Last Mile Customer S-ervice\nHigh-end Hardware Configuration: Powered by Android 7.0 OS.16GB super memory gets rid of limited storage, slow diagnostic speed, and “dead” embarrassment. 6100mAh built-in chargeable battery supplies a constant flow of energy and mobile diagnostic way, no worry for power consumption.5“ Screen size(720P)Larger5” Color Touchscreen, A bigger screen size makes it easier to read, and a better experience when viewing live data stream .\n4X Faster Upgrade Chip:LAUNCH CRP123X scanner brings 4x faster,smarter and more stable processing speed and powerful diagnostic capability.\nWider Vehicle Compatibility,Global Version: Enhance communication with 2024 new vehicle models. Vehicles and add/complete more functions and parameter data for 1996-2024 vehicles. The perfect choice for repairing the garage to serve more vehicles and win more customers, achieving business booming. The CRP123X scanner even works on SUVs, Passenger Cars, 12V Light-duty Trucks, Pickups, etc.\nLifetime Free Update:CRP123X offers the lifetime free update policy, which means you don't have to worry about not being able to use the product when it expires. In addition, CRP123X obd2 scan tool maintains high frequency update rate from the customer's demand, constantly providing a cost-effective service to our customers!\nWider Cars Coverages and Massive Accumulation of Automotive Experience Data :CRP123X covers car brands from 1996-2024, over 57+ car brands and 100000+ cars are included in CRP123X and No IP Restriction, which means you don't have to worry about where you are and not being able to use it. Data source over two decades of cutting edge industry data support\n5 Years Wa-rran-ty & 60 Days No Reson Return:As a senior seller, we always consider standing in the customer's point of view for the sake of customers. In order to allow customers to rest assured that the bold shopping, we promise to customers a 5-year w-arranty, 60 days no reason to return the policy!In order to solve the problem of the last mile of customer s-ervice, the LAUNCH CRP123X team has set up a technical team of 30 engineers, overseas maintenance centers.\n>>>5 Years W-arr-anty:products come with a five-year w-arran-ty policy. From the date of purchase, we are responsible for the after-sales of your product within five years. If the product malfunctions and needs to be repaired in the course of use-via-：[email removed by eBay]\n>>>Lifetime Fr-ee Update:CRP129X adopts a lifetime free update policy, so you can save a large amount of update cost, which means you can always use CRP129X to diagnose your car, don't worry about not being able to use CRP129X because of the update problem.You just need to update it with one click through WIFI, which is very easy, avoiding the trouble of connecting to a computer to update.\nPayment\nDelivery details\nTerms of sales\nAbout us\nContact us\n1.We accept Credit cards、Debit card、Apple Pay、Google Pay etc.payment.\n\n2.Please contact us if you need to use another method to pay.\n\n3.Payment should be made within 4 days after bidding ends.\n\n4.Otherwise an Unpaid Item case will be opened to you.\n\n5.We are not responsible for buyers’ local taxes.\n\n6.Please include your special requests in eBay note if there is any. \n\n7.We reserve the final right of selling"}
{"itemId": "v1|110554924990|0", "title": "Automatic Brush Cleaner Electric Makeup Brush Cleaning Machine Fast Clean Dryer", "leafCategoryIds": ["159805"], "categories": [{"categoryId": "159805", "categoryName": "Brush Cleaners"}, {"categoryId": "26395", "categoryName": "Health & Beauty"}, {"categoryId": "31786", "categoryName": "Makeup"}, {"categoryId": "36409", "categoryName": "Makeup Tools & Accessories"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/jogAAOSwuaJmOdYO/s-l225.jpg"}, "price": {"value": "14.69", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554924990%7C0", "seller": {"username": "testuser_pa4_demo_5", "feedbackPercentage": "100.0", "feedbackScore": 2}, "condition": "New with box", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/jogAAOSwuaJmOdYO/s-l1600.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE", "BEST_OFFER"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/Automatic-Brush-Cleaner-Electric-Makeup-Brush-Cleaning-Machine-Fast-Clean-Dryer-/110554924990?hash=item19bd9647be:g:jogAAOSwuaJmOdYO", "itemLocation": {"country": "US"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/UpYAAOSwlOlmOdYP/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/UN0AAOSwjKtmOdYQ/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/vC0AAOSw0lJl7uNq/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/4NMAAOSwJhFl7uNp/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/toYAAOSwgTpl7uNs/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/zXsAAOSw~Mhl7uNt/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/0VwAAOSw~FRl7uNm/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/9A4AAOSwM2Zl7uNr/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/zoMAAOSw8Pxl7uNw/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/7aUAAOSwlyJl7uNo/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/G8kAAOSwGvNmOdYS/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/B1sAAOSw2VZmOdYT/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/lOwAAOSwUBJl7uNu/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/yBsAAOSw0YpmOdYU/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/zSkAAOSwO~Rl7uNn/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/lNAAAOSwXItl7uNx/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/mCEAAOSwFC5lztO9/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554924990", "availableCoupons": false, "itemCreationDate": "2024-05-07T07:25:13.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "listingMarketplaceId": "EBAY_US", "item_description": "Automatic Brush Cleaner Electric Makeup Brush Cleaning Machine Fast Clean Dryer\n🏖️Description\nOur electric makeup brush cleaner is newly upgraded and immediately become an necessary for every girl to free themself from all the trouble on cleaning their brushes, This Electric Makeup Brush Cleaner is very practical. It not only saves you the trouble of manually cleaning your makeup brushes but also meets your different cleaning needs. It provides great convenience for your life，get one for yourself without any hesitation.\nTips\nStep One: Pour certain amount of water and cleaning liquid, make sure that the water is below the max line marked.\nStep Two: Press the button to start the machine and wait till the cleaning procedure finish.\nStep Three: Reverse the topper for the brush to be dried naturally.\nStep Four: Reverse the topper again to storage the brush and keep it from dust.\n🏝️Features\n【ELECTRIC MAKEUP BRUSH CLEANER】Save time and effort, no need to assemble, large capacity. Are you still scrubbing your makeup brushes by hand on the makeup brush cleaning mat? Are you still using an old-fashioned makeup brush cleaner? The Makeup Brush Cleaner automatically cleans multiple makeup brushes at a time, and it works with almost all sizes of makeup brushes. From small eye shadow brushes to large foundation brushes, it handles them all with ease.\n【3-IN-1 DESIGN】Unlike traditional manual cosmetics brush cleaners, we combine the functions of washing, drying and storage. After you finish cleaning, you can turn the silicone cover upside down to dry. Finally, you can insert the makeup brush into the silicone case and store it to avoid dust.\n【DEEP CLEANING】The Makeup Brush Cleaner is professional and impressive. Let's give your makeup brushes a powerful bath together and see how much dirty makeup residue brushes are harboring. Based on sonic vibration with a 7000rpm/min speed, this cosmetic brush cleaner effectively removes residues, oils, and impurities from brush crevices, grooves, and even tight corners without damaging the brush's shape and softness. The transparent body provides a clear view of the cleaning process.\n【COMPACT AND PORTABLE】: Our makeup brush cleaner is compact and travel-friendly. With the included USB charging cable and adapter, use it anywhere – be it your bedroom, bathroom, or on travel during outings, travel, or work. Keep your brushes clean wherever you are.\n【EASY TO OPERATE】The automatic makeup brush cleaner is powered by USB and is easy to operate, just add water and cleaning solution, press the switch and it is ready to use (don't exceed the maximum amount of water). Turn the silicone cap upside down to air dry the brushes after deep cleaning or use this brush blender for storing makeup brushes. Be sure to use a 5V2A adapter plug, otherwise it will not work and the touch switch will be out of order.\n【EXQUISITE AND PORTABLE】As a makeup lover, it's vital to keep beauty and makeup tools hygienic. This makeup brush cleaner is delicate and beautiful, and can be easily fit into cosmetic collection to add style to your beauty routine. Cosmetic brush cleaner is small and portable, can be taken with you when traveling and playing, so you can stay beautiful at all times. The silicone cap fits almost all brushes, but for oversized and irregularly shaped brushes, you’ll need to clean them manually.\n【PERFECT GIFT】This spinning makeup brush cleaner frees your hands and makes cleaning makeup brushes easier and faster, perfect for women who care about the health of their face skin, family members, professional makeup artists and makeup enthusiasts. Electric Makeup brush cleaner is a perfect gift for your beloved ones on Valentine's Day, Christmas, anniversary or birthday. Trust me, you will love this makeup brush cleaner machine after using it!\n【WARM TIPS】⚠1.Please make sure to use 5V2A adapter plug, otherwise it will not work properly and the switch will be out of work. ⚠2.Do not fill the water beyond the maximum water mark. ⚠3.The makeup brush cleaner is based on sonic vibration for cleaning, it will not damage the shape of makeup brushes. ⚠4.The silicone lid's micro-elastic make it suitable for all brushes, but for oversized and irregularly shaped brushes, you need to clean them manually.\n⛲Specification\nMaterial: ABS+PC+TPE\nColor: White / clear\nSize: 16*9*9 cm / 6.3*3.5*3.5 inch (approximately)\nVoltage: 5V\nRated power: 8W\nRated current: 1.5A\nWorking mode: 5V inline\nSpeed: 7000 rpm\nBattery: Built-in-800mAh Battery （ Rechargeable ）\n🪂Package Included\n1 X Electric cleaning brush\n1 X charger\n1 X instructions\n🗽Note\n⚠1.Please make sure to use 5V2A adapter plug, otherwise it will not work properly and the switch will be out of work. \n⚠2.Do not fill the water beyond the maximum water mark.\n⚠3.The makeup brush cleaner is based on sonic vibration for cleaning, it will not damage the shape of makeup brushes. \n⚠4.The silicone lid's micro-elastic make it suitable for all brushes, but for oversized and irregularly shaped brushes, you need to clean them manually.\nPayment\nDelivery details\nTerms of sales\nAbout us\nContact us\n1.We gladly accept payment methods eBay approved.\n2.Please make sure your eBay address is correct before you pay.\n3.All payment Should be Completed within 7 days, or an unpaid disputed will be opened as payment none receive.\n4.If you do not want to pay for the order please contact us via eBay message, we will help your cancel the transaction.\n5.Please make sure to submit the eBay item number with your payment. If you have any special requirements or requests, please contact via eBay message."}
{"itemId": "v1|110554930019|0", "title": "4 Wheel Power Mobility Scooter Heavy Duty Travel Wheel Chair Electric with Light", "leafCategoryIds": ["75068"], "categories": [{"categoryId": "75068", "categoryName": "Mobility Scooters"}, {"categoryId": "26395", "categoryName": "Health & Beauty"}, {"categoryId": "11778", "categoryName": "Medical & Mobility"}, {"categoryId": "28175", "categoryName": "Mobility/Walking Equipment"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/VdIAAOSwtYJl5Bug/s-l225.jpg"}, "price": {"value": "599.00", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554930019%7C0", "seller": {"username": "testuser_pa4_demo_6", "feedbackPercentage": "0.0", "feedbackScore": 500}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/VdIAAOSwtYJl5Bug/s-l1600.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE", "BEST_OFFER"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/4-Wheel-Power-Mobility-Scooter-Heavy-Duty-Travel-Wheel-Chair-Electric-with-Light-/110554930019?hash=item19bd965b63:g:VdIAAOSwtYJl5Bug", "itemLocation": {"city": "Rowland Heights", "postalCode": "917**", "country": "US"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/DZ0AAOSwAl1l5Bui/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/ytcAAOSwdb1l5Bup/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/XLkAAOSw3ldl5Bur/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/8DcAAOSwnG1l5Buu/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/hgIAAOSw1U1l5Buw/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/24cAAOSw0n5l5Buz/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/assAAOSwLQ9l5Bu1/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/TjIAAOSwi9Zl5Bu4/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/6m0AAOSwB7dl5Bu6/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/lv4AAOSwF0Jl5Bu9/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/-rwAAOSwNKtl5Bu~/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/G7IAAOSw~khl5BvC/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/h4sAAOSw-jtl5BvE/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/NIYAAOSwdkhl5BvG/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/U2IAAOSwbFtl5BvJ/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/d3cAAOSw7pRl5BvL/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554930019", "availableCoupons": false, "itemCreationDate": "2024-05-09T15:06:22.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "listingMarketplaceId": "EBAY_US", "item_description": "    Innuovo 4 Wheel Power Mobility Scooter Heavy Duty Travel with light 2022 upgrade\n【Main Parameters 】 Max Weight Capacity: 300 lbs / Max Speed: 6 mph / Range: 20 miles per charge / Climbing Slope: 8º / Battery Capacity: 12V/12Ah\n【Comfort Adjustable Seating 】 The spacious seat and backrest can provide gentle cushioning and support ; the height-adjustable seat can easily be customized to comfort your legs ; the scooter is also surrounded by two padded armrests that you can adjust them forward or backward for greater convenience when getting on or off the scooter.\n【Safety First 】 The mobility scooter is equipped with four pneumatic tires and anti-roll wheels to give you more comfortable and smooth driving experience,even when the vehicle drives on moderately rough roads.And the scooter is designed with the intuitive control panel which is easy to operate. It is designed with electromagnetic brake which is easy to control and much safer. The scooter comes with headlights and brake lights to ensure safe driving.\n【 Easy to Transport 】 It is easy to disassemble the mobility scooter into four separate pieces without tools, you can put them in the trunk of standard size vehicles and making your travel much more convenient and comfortable!\n【INTUITIVE CONTROL PANEL】 Located on the tiller console, the control panel allows you to set the maximum speed with the variable speed dial, change from a forward to a reverse direction, turn on the headlight as well as produce a warning tone as needed. The display also includes a color-coded battery life indicator for checking the status of the battery at a glance.\n        Intuitive Control Plate,ABS Basket\nIntuitive Control Plate allows you to control effortlessly, and Meter will show the power directly.The storage basket made of the new ABS material has higher durability than the old iron storage basket and is not easy to deform.\nEasily load and unload battery\nAccurate battery slot allows you to easily load and unload battery.\nDual Rear Anti-Tipper\nPrevent rollover and landslide.Dual Rear Anti-Tipper for promoting the security of the slope driving.\n          TECHNICAL SPECIFICATIONS\nMotor 24V 180W\nMax. Weight Capacity 265 lbs\nDriving Distance 13 Miles or more\nBraking Electromagnetic Brake\nCliming Gradeability 9 Degree or more\nBattery 2x12V 12AH\nSeat Size 13.78\"x15.75\"x20.47\"\nProduct Size 40.55\"x19.68\"x33.07\"\nScooter Weight 92.6 lbs\nPackage Wight 108 lbs\nFeatures\nDual model can switch quickly.\n4 Wheel configuration provides additional stability.\nQuick and easy disassembly into 4 easy-to-transport pieces.\nHeight-adjustable swivel seat with fold-down backrest.\nComfortable, Armrests are padded and adjustable.\nComes with large metal carry basket.\nSolid, non-marking, flat-free tires for worry-free travel.\nAnti-tip wheels for greater safety.\nHeadlight for enhanced safety.\nDelta tiller is easy to adjust; Ergonomic throttle control with easy freewheel operation.\nSeat back folds completely flat, which comes in handy when transporting or storing the scooter.\nComes with easy to remove, quick connect battery pack that can be charged separately from the scooter.\nWarranty: Lifetime on frame, 24 months on electric controller and drive train components, 12 months on batteries.\nFolded size:     \n39.37'' X 19.68'' X 14.96''\nSpecifications\nWeight Capacity 300 lbs.\nTop Speed 3.73 mph\nEstimated Range 15 miles\nMax Climbing Angle 6°\nTurning Radius 53.75\"\nGround Clearance 2.5\"\nDimensions 105cm  (L) x 52cm (W) x 75cm (H)\nMotor 24V x 270W x 4700rpm\nBatteries 12V/12AH x 2\nBattery weight 9.5kg\nColor Red\nCharger 3A\nBrakes Electromagnetic\nFreewheel Mode Yes\nFront Wheels 8\" x 2\"\nRear Wheels 8\" x 2\"\nAnti-Tip Wheels Yes\nBase Weight 70 lbs.\nSeat Weight 23 lbs.\nTotal Weight 110 lbs.\n\nPackage including:\n1x Blue 4 wheels Electric Wheelchair\n1x Charger\n1x English Manual.\n\nItem Specifics\nBrand : Innuovo\nMaximum Load Capacity : Up to 300lbs\nTop Speed : Less than 5mph\nFeatures : Electric, Non-Marking Tires, Removable Battery, Swivel Seat\nItem Length : 105cm\nItem Height : 75cm\nItem Width : 52cm\nUPC : Does not apply\nVehicle Height : 75cm\nVehicle Width : 52cm\nMPN : W3431\nSuitable For : All Terrains\nColor : Blue\nType : 4-Wheeled Scooter\nMPN : W3431"}
{"itemId": "v1|110554925995|0", "title": "Car Diagnostic Scanner OBD2 Scan Tool Code Reader Check Engine Fault ANCEL AD410", "leafCategoryIds": ["179476"], "categories": [{"categoryId": "179476", "categoryName": "Code Readers & Scanners"}, {"categoryId": "6000", "categoryName": "eBay Motors"}, {"categoryId": "34998", "categoryName": "Automotive Tools & Supplies"}, {"categoryId": "179474", "categoryName": "Diagnostic Service Tools"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/FFIAAOSwaeVlMXUT/s-l225.jpg"}, "price": {"value": "37.99", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554925995%7C0", "seller": {"username": "testuser_pa4_demo_5", "feedbackPercentage": "100.0", "feedbackScore": 2}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/FFIAAOSwaeVlMXUT/s-l1200.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE", "BEST_OFFER"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/Car-Diagnostic-Scanner-OBD2-Scan-Tool-Code-Reader-Check-Engine-Fault-ANCEL-AD410-/110554925995?hash=item19bd964bab:g:FFIAAOSwaeVlMXUT", "itemLocation": {"city": "Houston", "postalCode": "770**", "country": "US"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/6h8AAOSwKFRlMXUU/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/YhsAAOSwSe9lMXUU/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/t8sAAOSwQ6VlMXUW/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/-EsAAOSw6M1lMXUW/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/EO4AAOSw39hlMXUX/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/W7gAAOSwubJlMXUY/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/TqAAAOSwMhdlMXUZ/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/M8MAAOSwGyhlMXUa/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/HCcAAOSw-AplMXUa/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/bqAAAOSwILtlMXUb/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/ATgAAOSwoVJlMXUc/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554925995", "availableCoupons": false, "itemCreationDate": "2024-05-08T03:32:31.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "item_description": "Car Diagnostic Scanner OBD2 Scan Tool Code Reader Check Engine Fault ANCEL AD410\nCar OBD2 Scanner Auto Diagnostic Scan Tool Code Reader\n-Engine Check, Turn Off MIL, Full 10 OBD2 Functions, Read&Clear Codes, DTC Lookup, Lifetime Free Update- \n  Ancel AD410 is a great upgrade from basic car code readers, read and erase codes when engine lights come on. Shows real-time live data reported by the ECU, engine temperature, O2 sensor readings etc.\n   Advantages\nLifetime Free Online Update.\nSupports English,French,Spanish,Germany,Russian,Portuguese,Dutch,Finish\nSupport 9 Modules OBD2 Engine Function, Read Live Data, Freeze Frame Data\nSpecial I/M Hot Key, quick state emissions readiness check and drive cycle verification\nBuilt-in OBD2 Fault Code look-up library, easy to know the error code meaning.\nLive O2 Sensor Data Display, Reads Live PCM Datastream\nOn-board Monitoring System, Evap System \n Functions\n Built-in OBD-II DTC Look up library ,\nPlug-and-play interface and highly reliable, Much More stable than ELM327\nThe AD410 scanner is well built with a large LCD display (128 x 64 pixel), indicates test results directly.\nNo batteries,supply power through a 2.5 feet long cable and made of a very thick flexible insulator.\nSmall size and conveniently fits in your palm.\nEasily determines the cause of the check engine light. I/M monitor readiness test, turn off the MIL (check engine light)\nReads & clears Faults code in fast speed: generic codes, pending codes and manufacturer's specific codes.\nReads live data stream.\nDisplays I/M readiness Status one hot key.\nDetects OBD-II Freeze Frame Information\nRetrieves Vehicle information (VIN, CID and CVN number\nNewest Function for AD410:Print data,free update online ,feedback function\n NOTE:\n Not Support Russian Cars, VAZ,UAZ,LADA\nNot works with Trucks, Pickups, Vans\n  Important Information\n Even though it compatible with most cars, but different regions support the vehicle OBD2 protocol at different times, or some car is special design, so it may not compatible with some cars which do not support OBD2 protocol. Especially Japanese and Korean car brand.\nPlease Leave us message in below format,we will reply you within 8 hours.For Example: Nissan, 2005, 2.0cc, Diesel,is it suit?\n AD410 Package List\n1* Ancel AD410 OBD2 Engine Scanner\n1* Usb Cable\n1* User Manua\nPayment\nShipping\nTerms of sales\nAbout us\nContact us\n- We accept all common forms of payment such as Credit cards、Debit card ,Google Pay ,Visa etc. \n- Please contact us if you need to use another method to pay.\n- Payment should be made within 7 days after bidding ends.  Otherwise a Unpaid Item case will be opened to you.\n \n\n\n\n\n\n\n\n\n\n\nFunction 1 Built-in OBD-II DTC Look up library\nFunction 2 Live O2 Sensor Data Display\nFunction 3 Reads Live PCM Datastream\nFunction 4 On-board Monitoring System, Evap System\nFunction 5 Detects OBD-II Freeze Frame Information\nFunction 6 Reads Faults code\nFunction 7 Clears Faults code\nFunction 8 Retrieves Vehicle information\nFunction 9 EVAP System\nFunction 10 I/M Readiness Status\nFit Car 1 1996 and newer US Cars\nFit Car 2 2000 and newer EU Cars\nFit Car 3 2008 and newer Asia Cars\nCompatible Car Makes for Ford Chrysler GM Jeep VW BMW Benz Audi,etc.\nSimilar Mode1 Foxwell NT301 , Foxwell NT201\nLanguage 1 Russian, Spanish, Portuguese, English\nLanguage 2 French, German, Dutch, Finland\nBrand Ancel\nManufacturer Part Number Universal Vehicle Automotive Scanner Diagnostic Tool\nOBD Interface CAN, EOBD, OBDII, OBD\nConnectivity 16PIN OBD2 Port\nSupported System Engine\nVehicle Type Passenger Vehicle\nFeatures Color Display, Check Engine Light Shut Off, Erases Codes, Freeze Frame Displays, Internet Updateable, LCD Display, Multi-Language Interface, User Friendly\nMPN AD410 as Foxwell NT301 Konwei KW850\nWarranty 3 Year"}
{"itemId": "v1|110554921050|0", "title": "USB Rechargeable LED Bicycle Headlight Bike Front Rear Lamp Cycling Light IP65", "leafCategoryIds": ["22689"], "categories": [{"categoryId": "22689", "categoryName": "Lights & Reflectors"}, {"categoryId": "888", "categoryName": "Sporting Goods"}, {"categoryId": "7294", "categoryName": "Cycling"}, {"categoryId": "177832", "categoryName": "Bicycle Accessories"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/KkkAAOSw5d5lP-dl/s-l225.jpg"}, "price": {"value": "13.90", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554921050%7C0", "seller": {"feedbackScore": 500}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/KkkAAOSw5d5lP-dl/s-l225.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/USB-Rechargeable-LED-Bicycle-Headlight-Bike-Front-Rear-Lamp-Cycling-Light-IP65-/110554921050?hash=item19bd96385a:g:KkkAAOSw5d5lP-dl", "itemLocation": {"city": "San Jose", "postalCode": "951**", "country": "US"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/hJMAAOSwpNRlP-dm/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/~44AAOSw2EdlP-dn/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/D-sAAOSwrudlP-dn/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/JIkAAOSwnf5lP-dp/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/KloAAOSw5d5lP-dq/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/~gsAAOSw4phlP-dq/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/PUIAAOSw00BlP-dr/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/rKIAAOSwAk1lP-ds/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/jxkAAOSwtpplP-dt/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/N9YAAOSwrFNlP-du/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/TmEAAOSwRHdlP-dv/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/MFwAAOSwXO9lP-dw/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/xswAAOSwgqRlP-dx/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554921050", "availableCoupons": false, "itemCreationDate": "2024-05-03T13:39:04.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "listingMarketplaceId": "EBAY_US", "item_description": "Feature：\n1.Multi-light source design: Using the combination of low beam and high beam, the irradiation distance is farther and the irradiation range is wider to meet the needs of different scenarios.Better lighting effect, safer night riding.\n2.Ultra-high brightness: Using multi-lamp combination, 900 lumens brightness, wider and wider illumination range, and the range can reach hundreds of meters in high beam mode.Using the USB TypC charging interface, charging is more convenient.\n3.Advanced Design: The exquisite exterior design makes you stand out in the fleet.\n4.Sturdy & Durable: High-strength plastic shell is used to prevent scratching, and it is resistant to falling, smashing, durability and waterproof.The headlight are very easy to install,no tools are required.\n5.Multiple Modes: 4 lighting modes, which can adapt to different scenes.  Besides being used as a bicycle light, you can also use it for night running, camping, fishing, night work and activities, etc.It is also a good choice as a gift.So, start your next adventure with us.\n Specification:\nMaterial: ABS + Aluminum alloy\nType:Rechargeable Bike Front Handlebar Light\nLamp type: TG3\nNumber of lamp beads: 3\nBattery type: 18650 lithium battery\nBattery capacity: 2000mah\nLumens: 900LM\nLight color: white\nInput Power: DC5v 1A\nCharging interface: USB Type-c interface\nLighting mode: 4 modes (High Beam + Low Beam + All Bright + Flash)\nEndurance: high light 2 hours, low light 2.5 hours,all bright 1.5 hours, flash 2 hours\nCharging time: about 3 hours\nWaterproof class: IP65\nSize : 9.5*4*2.6cm/3.75*1.57*1.02 inch\n Package Included:\n🎁1 x Bike Light\n🎁 1 x USB-C Charging Cable\n🎁 1 x Mounting Bracket\n🎁 1 x Screws\n🎁 1 x Screwdriver\n🎁 1 x User manual\nPayment\nDelivery details\nTerms of sales\nAbout us\nContact us\n1.We accept many payment methods.\n2.The item will be shipped to buyer’s CORRECT and VERIFIED Ebay Address.\n3.We are not responsible for the package lost due to incorrect address.\n4.Our price do not including any custom or duty, VAT and local tax.\n5.Payment must be received within 7 days of winning the auction\n6.Please contact us if you need file an extension for any late payment.\n "}
{"itemId": "v1|110554939564|0", "title": "THINKCAR Auto Scanner Car Diagnostic Tool OBD2 Code Reader Engine SRS ABS TCM", "leafCategoryIds": ["179476"], "categories": [{"categoryId": "179476", "categoryName": "Code Readers & Scanners"}, {"categoryId": "6000", "categoryName": "eBay Motors"}, {"categoryId": "34998", "categoryName": "Automotive Tools & Supplies"}, {"categoryId": "179474", "categoryName": "Diagnostic Service Tools"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/pF0AAOSwjMZl96uf/s-l225.jpg"}, "price": {"value": "109.00", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554939564%7C0", "seller": {"username": "testuser_pa4_demo_1", "feedbackPercentage": "100.0", "feedbackScore": 1}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/pF0AAOSwjMZl96uf/s-l1200.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE", "BEST_OFFER"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/THINKCAR-Auto-Scanner-Car-Diagnostic-Tool-OBD2-Code-Reader-Engine-SRS-ABS-TCM-/110554939564?hash=item19bd9680ac:g:pF0AAOSwjMZl96uf", "itemLocation": {"city": "Perth Amboy", "postalCode": "088**", "country": "US"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/1WUAAOSw4DNlliw~/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/EsAAAOSwvsJllixA/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/kqQAAOSwg2Nlliw-/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/1uQAAOSwMYNllixD/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/btoAAOSwk79llixG/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/NvgAAOSwarFllixE/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/SOoAAOSwus5llixC/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/SsoAAOSwUrdkDCz6/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/WJIAAOSwJ5VkDCz5/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/89MAAOSwLQRhglwX/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554939564", "availableCoupons": false, "itemCreationDate": "2024-05-14T08:10:02.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "item_description": "ThinkScan Plus S5 Auto Scanner Diagnostic Tool OBD2 Code Reader Engine SRS ABS\nWhat is THINKSCAN Plus S5\nThinkscan Plus S5 products are a new generation of mid-to-high end DIY products based on Android system launched by THINKCAR, which can realize online upgrade of diagnostic software. Its main functions include not only OBD/EOBD standard protocol diagnosis, but more importantly, it has professional vehicle diagnostic software and maintenance software, which can perform a comprehensive diagnosis of all vehicle electronic control systems. Different series support different systems and functions.\nWhy You Need THINKSCAN Plus S5?\nAre you troubled by the renewal of model software and functions? THINKSCAN Plus S5 Support to 4 Systems(ECM/ABS/SRS/TCM)\n1.Thinkscan Plus S5 Support to diagnostic ECM/ABS/SRS/TCM system errors, and delete the errors.\n2.Thinkscan Plus S5 supports to do Full obd2 function,including Read/Clear codes,data stream,I/M readiness,O2 sensor,DTC look up and more....\n3.Thinkscan Plus S5 supports 28 Resets Service($29.95/Reset)\n4.You can do screen shortcuts via I/M key with Thinkscan Plus S7 devices, easy and fast\n5.Thinkscan Plus S5 Support to printe Diagnostic Report data, checking errors\n6.Thinkscan Plus S5 software update free lifetime.\nLifetime Free All Cars 4 Systems Diagnostic:\nThis car obd2 scanner is capable of reading and clearing trouble codes of  ECM/ABS/SRS/TCM/ Systems.\nDiagnose ECM (Check Engine) System:\nQuickly determine the cause of the Engine System, and turn off the warning light. It also retrieves current, permanent, and pending codes in the vehicle engine system, What's more, it also shows critical OBD II standard extended data, such as fuel, emissions data, and other real-time manufacturer-specific parameters in the engine system for making sure it works correctly and safely.\nDiagnose ABS (Anti-lock Braking) System:\nRead and clear the error code in the ABS and turn off the warning light. It retrieves ABS codes to make braking more smooth, consistent, and safe. It also performs live data streams in the ABS that allows the user to monitor and diagnose critical ABS systems to ensure that repairs to these critical systems are effective and complete.\nDiagnose SRS (Airbag) System:\nA safety restraint system, is made up of impact sensors, a control module, and the airbags themselves, and this diagnostic device can detect every electronic parameter to check its health status.\nDiagnose TCM(Auto Transmission) System:\nAT(automatic transmission) system is one of the powertrain control modules, but some issues like un-working electronic accessories and broken transmission computer will keep your transmission light flashing. It's hard to locate the accurate error within limited time. Fortunately, this car error code reader transmission scanner will assist you to have a fast scanning of your vehicle and read the fault code easily, shutting down the warning light within minutes when you finish the repair.\n               Support 28 Reset Services($29.95 /year for one Reser.)\nTHINKSCAN Plus S5 currently supports 28 maintenance software,  The maintenance software is completely free to use and free to upgrade.\n1.Oil Lamp Reset Service \nAllows you to perform reset for a new calculation of Engine Oil Life system once changed the oil.\n2.EPB Electronic Park Brake Reset\nIt is important in the maintenance of electronic braking system's safety and efficiency.\n3.BAT battery service \nAllows the scan tool to evaluate the battery charge state, monitor the close-circuit current, register the battery replacement, and activate the rest state of the vehicle.\n4.\nWindows Calibration\nThis feature is designed to perform door window matching to recover ECU initial memory, and recover the  automatic ascending and descending function of power window.\n 5.SAS Steering Angel Sensor Reset\nHelps clear the fault steering angle sensor memories and plays an important role in the steering angle sensor calibration.\n6.TPMS Tire Pressure Monitoring System Reset\nMakes sense in displaying sensor IDs from the vehicle's ECU, inputting TPMS sensor replacement IDs and testing sensors.\n7.IMMO Reset\n1 In order to prevent the car from being used by illegal keys, through the anti-theft key matching function, the car can only be used normally after the anti-theft device control system on the car recognizes and authorizes the remote control.\n2 Anti-theft matching is required when replacing the ignition switch key, ignition switch, combination meter, engine control unit (ECU), body control module (BCM) and remote control battery \n8.ABS Bleeding\nABS brake bleeding to get a firm brake pad after air exhaustion after repair ABS pump system.\n9.Sunroof Reset\nThe sunroof needs to be reset when the sunroof control unit have communication problem or changed.\n10.Suspension Reset \nTry reset electronic suspension air ride with the massage system close all doors koeo flip through messages system go to suspension reset or on off.\n11.Gearbox (Transmission )Reset \nProcedure Reset Transmission Adaptive Learning DIY. Start the car and drive. Once you perform this procedure the Engine Control Unit (ECU) and Transmission Control Unit (TCU) will work together to learn how you drive by monitoring your driving pattern. After you follow this programming method of the TCU / ECU drive the car.\n12.AFS Headlamp Reset\n'AFS' means Adaptive Front lighting System (at night with the Bi-Xenon headlights) it swivels either side, pressing that button means they stay pointing straight ahead and don't turn when you turn the steering wheel.\n13.Injector Coding\nLeaking injectors and some dead injectors can be missed even when an injector is disabled. Other problems with the ignition system and mechanical components also may not show an rpm loss when an injector is turned off.\n14.Throttle Adaptation \nThe throttle body is a tube containing a pivoting flat valve (butterfly) that is used to control the amount of air entering an engine. In an electronically fuel injected car, a throttle position sensor and air flow sensor communicate with the computer, which supplies the corresponding amount of fuel needed at the injectors. It must need re-learning throttle sensor position after clearing or repair.\n15.Gear Learning \nThe scan tool monitors certain camshaft position sensors signals to determine if all conditions are met to continue with the procedure for Engine running.16.EGR Reset  Reduce nitrogen oxides (NOx) in the exhaust gas and improve fuel economy at partial load.\n17.A/F Reset\nThis function is applied to set or learn Air/Fuel ratio parameters.\n18.Adblue Reset(Diesel Engine Exhaust Gas Filter)\nAfter the diesel exhaust treatment fluid (car urea) is replaced or filled up, urea reset operation is required.\n19.Airbag Reset\nThis function resets the airbag data to clear the airbag collision fault indicator.\n20.Coolant Bleeding\nUse this function to activate the electronic water pump before venting the cooling system.\n21.AT Learning\nThis function can complete the gearbox self-learning to improve gear shifting quality. When the gearbox is disassembled or repaired (after some of the car battery is powered off), it will lead to shift delay or impact problem. In this case, this function needs to be done so that the gearbox can automatically compensate according to the driving conditions so as to achieve more comfortable and better shift\n22.Language Change\nThis function is used to change the system language of the vehicle central control panel.\n23.Nox Sensor Reset\nNox sensor is a sensor used to detect the content of nitrogen oxides (Nox) in engine exhaust. lf the Nox fault is re-initialized and the Nox catalytic converter is replaced, it is necessary to reset the catalytic converter learned value stored in the engine Ecu.\n24.Transport Mode \nln order to reduce power consumption, the following functions may be disabled, including limiting the vehicle speed, not waking up the door opening network, and disabling the remote control key, etc.At this time, the transport mode needs to be deactivated to restore the vehicle to normal.\n25.Stop/Start Reset\nThis function is used to open or close the automatic start-stop function via setting the hidden function in ECU(provided that the vehicle has a hidden function and supported by hardware).\n26.Seat Calibration\nThis function is applied to match the seats with memory function that are replaced and repaired.\n  Support 10 Multi-language\nEnglish, French, German, Spanish, Italian, Portuguese, Japanese, Russian,Polish\nFree Full OBDII Functions\n*-Read extensive current, pending and permanent codes in OBD system quickly\n*-Clear detected fault codes and turn off the Check Engine Light efficiently\n*-View graphical live data of vehicle's computer module(s) for easy analyses\n*-View the vehicle's operating parameters at the moment a DTC is detected\n*-Read I/M readiness status to have a vehicle inspected for state emissions compliance\n*-Perform O2 sensor test to check fuel efficiency and vehicle emissions\n*-Read the results of on-board diagnostic monitoring tests for specific components/systems\n*-Retrieve the vehicle information of VIN, CINs, and CVNs completely\n*-Perform the component Test by allowing initiating a leak test for the vehicle's EVAP system\nHow to Register/Update Thinkscan Plus S5\n1.Initial Use 2.Turn on the Machine 3.Language Setting 4.Connect WIFI 5.Choose Time Zone 6.User Agreement 7.Create an Account 8.Typing in Business Information\nSupport 126+ Worldwide Vehicle Coverage\nSupport 126+ Car Brands and 1000+ Vehicles\nUSA：\nFor BXGM,For CHRYSLER, For AUSTFORD, For GM,USAFORD\nEUROPE:\nFor ASTONMARTIN,For AUDI,For BENZ,For BMW,For BXFIAT,For CITROEN,For FERRARI,For FIAT,For GAZ,For LANDROVER,For MASE,RATI,For OPEL,For PAZ,For PEUGEOT,For PORSCHE...\nAustrillia:\nFor AUSTFORD,For AUSTHOLDEN\nAsia:\nFor BAIC,For CHANGAN,For CHANGCHENG,For CHANGHE,For DAEWOO,For DAIHATSU,For DFXK,For FLYER,For FUTIAN,For HAFEL For HMAZDA,For HONDA,For HUACHEN,For HYUNDAI,For IKCO,For INDIANMARUTI,For INDIANTATA,For ISUZU,For IVECO.IZH,For JACTY JIAO,For JINLONG,For JOYLONG,For JPISUZU,KIA,For LIFAN, For LIUWEITY ,For LUXGEN,For MAHINDRA,For MALAYSIA PERODUA,For MALAYSIA PROTON,For MARUT,For MAXUS,For MAZDA,For MITSUBISHI...\nFor people\n1.Car service technician 2.Small and medium repair shop 3.Individual owners who like deep DIY vehicles.\nApplication scenario\n1.For maintenance technicians, the Thinkscan Plus, which is convenient to carry, is the best choice for road rescue or door-to-door service.\n2.For small repair shops, there is no need to purchase expensive diagnostic equipment, Thinkscan Plus can also meet the fault diagnosis of different brands of vehicles.\n3.In-depth DIY car owners, car owners with certain maintenance skills and strong hands-on ability, can always keep this comprehensive and powerful, yet economical diagnostic equipment.\nProduct Parameters\nDisplay Screen ：5-Inch/TFT(IPS)\nConnection :Wi-Fi\nRAM:2G ROM:32G\nWorking Temperature : 32℉~122℉\nStorage Temperature: -4℉~144℉\"\nPacking List\n1*Thinkcar Thinkscan Plus S5 Host 1*Charging cable 1*manual\n  Payment\nDelivery details\nReturn details\nAbout us\nContact us\nWe accept the following payment methods\nTo ensure that your items can be delivered as soon as possible, please fill in your payment information accurately！\nThank you\n\n\n\n\n\n\n\nBrand ThinkCar\nManufacturer Part Number does not apply\nOBD Interface CAN, EOBD, OBD, OBDII\nConnectivity OBD2\nSupported System ABS, SRS, TCM, ECM\nVehicle Type Passenger Vehicle\nFeatures Backlit Display, Built-In Battery, Check Engine Light Shut Off, Color Display, Erases Codes, Freeze Frame Displays, Internet Updateable, LCD Display, Multi-Language Interface, User Friendly\nAccessories Adapter Cable, Software Disc, User Guide\nWarranty 1 Year\nFeature 1 4 System Diagnosis\nFeature 3 28 Reset Function ($29.95 per reset per year)\nFeature 2 OBD2 Function\nFeature 5 Support more than 93+ Car Brands\nFeature 4 Support 10 Languages\nOperating System Android 7.0\nDisplay 5-inch LCD capacitive touchscreen\nUnit Quantity 1\nUnit Type Unit\nExtra cost $29.95 per reset per year\nSupport Diagnostic System-1 Engine system Diagnosis\nSupport Diagnostic System-2 ABS(Anti-lock Braking) system Diagnosis\nSupport Diagnostic System-3 Transmission System Diagnosis\nSupport Diagnostic System-4 SRS (Airbag) system Diagnosis:"}
{"itemId": "v1|110554918269|410109440929", "title": "450W Sports Ebike Electric Scooter Adult w/ Seat Electric Moped E-Scooter Adults", "itemGroupHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/get_items_by_item_group?item_group_id=110554918269", "leafCategoryIds": ["74469"], "categories": [{"categoryId": "74469", "categoryName": "Electric Bicycles"}, {"categoryId": "888", "categoryName": "Sporting Goods"}, {"categoryId": "7294", "categoryName": "Cycling"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/LRYAAOSw0axmMJTv/s-l225.jpg"}, "price": {"value": "348.99", "currency": "USD"}, "itemGroupType": "SELLER_DEFINED_VARIATIONS", "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554918269%7C410109440929", "seller": {"username": "testuser_pa4_demo_4", "feedbackPercentage": "0.0", "feedbackScore": 500}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/LRYAAOSw0axmMJTv/s-l1200.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/450W-Sports-Ebike-Electric-Scooter-Adult-w-Seat-Electric-Moped-E-Scooter-Adults-/110554918269?hash=item19bd962d7d:g:LRYAAOSw0axmMJTv", "itemLocation": {"city": "Brea", "postalCode": "928**", "country": "US"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/NLEAAOSwZUVmEQWV/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/lM4AAOSwEfxmFlLl/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/DMsAAOSwmdtmFlLn/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/wpgAAOSw~xhmFlLp/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/vd4AAOSw~nNmFlLq/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/s0EAAOSwsJNmFlLs/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/GAMAAOSwE8BmFlLt/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/lMEAAOSw8LVmFlLv/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/q~MAAOSwOJpmFlLx/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/EyIAAOSw6o9mEXKH/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554918269", "availableCoupons": false, "itemCreationDate": "2024-04-30T06:51:34.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "listingMarketplaceId": "EBAY_US", "item_description": "450W Sports Ebike Electric Scooter Adult w/ Seat Electric Moped E-Scooter Adults\nFEATURES:\nElectric Scooters for adults with Seat: Adults MOTORIZED SCOOTER comes with a 450W powerful brushless motor and large 40 cells 10Ah Lithium-ion battery, enables a 20-mile range, and a max speed of 15.5 mph, which is ideal for anyone who wants to commute short distance for school or office and give the adults an active lifestyle\nFoldable Electric Scooter Lightweight : The foldable all terrain electric scooter only weighs 34.5 lbs, but can comfortably accommodate riders up to 265 lbs, which is pefect for man and woman. Our adults electric scooters can be easily folded and stored in the car trunk, which can be taken to anwhere easily, very perfect for commuters and students\nSafe and Durable: the sports electric scooter adults is equipped with double braking systems, the front and back disc brake of the electric bike give you double safety. The high-intensity LED front light and rear reflectors provide you a safe ride even in the evening. The 12\" tires is built special for multi-terrain of daily use or outdoor activities\nMinimalist Design and Easy Operation: After you receive our 2 wheel scooter for adults, you only need to assembe the seat and basket attachment. The handle bars are folded and just need to be erected. All needed tools is in the package, which you do not need to buy additional\nElectric Scooters Accessories: Sports electric scooter with basket come with 13 x 11 inch rear carry basket and scooter deck, front LED light and rear reflectors for safety. We Provide the Components -battery, LED light, and ringer bell a one-year warranty, which can be self-installed or replaced very easily. Any Problem, Please contact us.\nUL 2849 certifie Report No: HK2307281004-SR :https://productiq.ulprospector.com/en\nSPECIFICATION:\nType:Electric Bike\nTop Speed:15.5MPH\nEstimated Max Range: 20 miles\nMotor:450W Brushless Motor\nBattery:36V 10Ah\nCharging Time:3-6 Hours\nFoldable Position:Handlebar and Pedals\nSuspension:Center Suspension\nTire:12\" x 2.125\"\nOpened Scooter Size:48.5\" x 23\" x 37.5\"\nFolding Handlebar Size:48.5\" x 10\" x 23\"\nBike Weight:34.5 lbs\nAge Range:12+\nSuggested Use:Commute, Neighborhood, Camping, Exercise \nPACKAGE INCLUDES:\n1 x Electric bike\n1 x Charger\n1 x User Manual\n PAYMENT\nSHIPPING\nReturn and Refund Policy\nFEEDBACK\nHelp - Customer Support - Contac\nWe accept payment via PayPal. Use PayPal at checkout to pay with credit or debit.\nImmediate payment is required. Shipping will be arranged within 1 business day once payment is cleared."}
{"itemId": "v1|110554929604|0", "title": "Compass Ball Dashboard Mount Navigation For Car Truck Boat with Suction Cup", "leafCategoryIds": ["33654"], "categories": [{"categoryId": "33654", "categoryName": "Body Moldings & Trims"}, {"categoryId": "6000", "categoryName": "eBay Motors"}, {"categoryId": "6028", "categoryName": "Parts & Accessories"}, {"categoryId": "33637", "categoryName": "Exterior Parts & Accessories"}, {"categoryId": "6030", "categoryName": "Car & Truck Parts & Accessories"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/te0AAOSwsndl1At-/s-l225.jpg"}, "price": {"value": "2.90", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554929604%7C0", "seller": {"username": "testuser_pa4_demo_6", "feedbackPercentage": "0.0", "feedbackScore": 500}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/te0AAOSwsndl1At-/s-l1200.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE", "BEST_OFFER"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/Compass-Ball-Dashboard-Mount-Navigation-For-Car-Truck-Boat-with-Suction-Cup-/110554929604?hash=item19bd9659c4:g:te0AAOSwsndl1At-", "itemLocation": {"country": "CN"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/6MEAAOSwjQVl1AtI/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/GfIAAOSwMuhl1AtM/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/Bg4AAOSwLx5l1AtG/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/yTsAAOSwMC5l1AtH/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/vMcAAOSw-dZl1AtJ/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/YUcAAOSw3aJl1AtN/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/9swAAOSw3tdl1AtH/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/vNIAAOSwcMJl1AtH/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/QbUAAOSwdvJl1AtI/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/VwkAAOSwgD9l1AtG/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554929604", "availableCoupons": false, "itemCreationDate": "2024-05-09T05:23:57.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "item_description": "   \nM14x1.5 Car Engine Magnetic Oil Drain Plug Screw Nut Bolt Sump Nut Universal\n6.20 USD\nFree shipping  \n \nRed Car Paint Repair Pen Scratch Remover Touch Up Coat Applicator Fix Tools\n5.95 USD\nFree shipping  \n \nM14x1.5 Car Engine Magnetic Oil Drain Plug Screw Nut Bolt Sump Nut Universal\n5.90 USD\nFree shipping  \n \n4Pcs Blue Car Wheel Tire Tyre Air Valve Stem Cap LED Light Caps Accessories Trim\n8.50 USD\nFree shipping  \n \n2Pcs Red Non Slip Automatic Pedal Brake Foot Treadle Cover Car Accessories\n20.99 USD  \n \n100× Auto Fastener Clip Car Body Push Retainer Pin Rivet Bumper Door Trim Panel\n14.99 USD\nFree shipping  \n \nCar Cigarette Lighter Auxiliary USB Dual Power Outlet Socket Plug Adapter 12V\n16.99 USD\nFree shipping  \n \n20Pcs 17mm Black Car Hub Screw Cover Auto Wheel Nut Caps Bolt Rims Accessories\n14.99 USD\nFree shipping  \n     \n1.5Meters Car Exhaust Pipe Wrap Insulation Auto Insulation Heat Wrapped Tape\n18.99 USD\nFree shipping  \n \n2 Pcs Car Dual Holes Windshield Washer Nozzle Wiper Water Spray Jet Adjustable\n13.99 USD\nFree shipping  \n \n7 Pcs Windscreen Wiper Arm Washer Nozzle Jets 4 Way Check Valve Tube Pipe Hose\n16.99 USD\nFree shipping  \n \n4Pcs Green Car Wheel Tire Tyre Air Valve Stem Caps LED Light Accessories Bike\n9.99 USD\nFree shipping  \n \nMini Dual USB Type-C PD Car Phone Charger Fast Charge Adapter Accessories Trim\n28.99 USD\nFree shipping  \n \nM14*1.5 Magnetic Engine Oil Drain Plug Nut Screw Bolt Oil Drain Sump Nut Black\n4.50 USD\nFree shipping  \n \nCar Bike Bicycle Wheel Tire Tyre Air Valve Stem LED Light Caps Cover Universal\n4.49 USD\nFree shipping  \n \n4x 68mm Chrome Silver Car Wheel Center Hub Caps Covers Set No Logo Accessories\n20.99 USD\nFree shipping  \n    Compass Ball Dashboard Mount Navigation For Car Truck Boat with Suction Cup\n  International Buyers Please Note:\n- Import duties, taxes and charges are not included in the itemprice or shipping charges. These charges are the buyer responsibility.\n- Please check with your country customs office to determine what these additional costs will be prior to bidding/buying.\n  We will carefully test every item before shipment.\nThe quality is guaranteed!\n    ❤ Please contact us before you give the bad feedback, if the products have any problems.Thanks for your understandings.❤\n\nDescription\n100% brand new, high quality\nType: Compass\nMaterial: plastic + rubber + oil + magnet\n\nFeatures:\nSimple and practical design\nBall shape, strong decorative effect\nBubble ball seat type, indicating direction, display level, display vibration\nUsed in your car, can be clamped or built-in adhesive\n\nPackage Included:\n1 pc compass\n         \nWe accept PayPal only.\nAll major credit cards are accepted through secure payment processor PayPal.\nPayment must be received within 7 business days of auction closing.\nIf you have bought multiple items from me, you can send me one payment for all the items instead of paying for them individually. When you click the Pay Now button, eBay will automatically determine if there are other items you have won or purchased from me and will combine them for your review.\nOnly through PayPal\n\n\n1.We ship to eBay address. Please make sure your address in ebay is matched with\nyour shipping address before you pay\n2.Please indicate your personal requirement, such as colors, packages, value of  declaration etc, at paypal's message when you pay to us.\n3.We will NOT be responsible for any delay during delivery including but not limited to customs postage checking, strike, force majeure etc.\n4.As a buyer, it is your duty to pay the tax when you make a order from abroad. \nOur price does not include taxes, VAT, or other hidden charges.\n\n\nReturn & Refund\nRefund or replacement request is available only the requests within 1 week after parcel received & returning the item as the same condition as received.\nPlease contact us to request a return authorization. Your name, auction number, and reason for return should be included in the email. All items returned must contain all original packaging materials.\nPlease repack the item carefully. Items returned will be tested and a new replacement will be shipped to the buyer immediately when found defective. In the event that a suitable replacement is not available then a refund will be issued. Shipping, handling and insurance fees are non refundable.\nIf the item is found non-defective, the item will be sent back to the buyer at buyer's expense. Items returned without RMA number will be refused and returned to the sender. Buyer is responsible for All Return Postage and Shipping Charges. Buyer is responsible for additional shipping costs for items that are returned refused and/or undeliverable. We do not accept any returns without an authorization number on the box or label it is being returned in.\n\n\n\n\n "}
{"itemId": "v1|110554947516|0", "title": "Pair RGB LED Laser Projector Whip Light Whipless Antenna Remote Cube UTV ATV CNC", "leafCategoryIds": ["174065"], "categories": [{"categoryId": "174065", "categoryName": "Other Lighting & Lamps"}, {"categoryId": "33707", "categoryName": "Lighting & Lamps"}, {"categoryId": "6000", "categoryName": "eBay Motors"}, {"categoryId": "6028", "categoryName": "Parts & Accessories"}, {"categoryId": "6030", "categoryName": "Car & Truck Parts & Accessories"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/tt4AAOSwaH5mRa0g/s-l225.jpg"}, "price": {"value": "248.00", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554947516%7C0", "seller": {"username": "testuser_pa4_demo_2", "feedbackPercentage": "0.0", "feedbackScore": 500}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/tt4AAOSwaH5mRa0g/s-l1200.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE", "BEST_OFFER"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/Pair-RGB-LED-Laser-Projector-Whip-Light-Whipless-Antenna-Remote-Cube-UTV-ATV-CNC-/110554947516?hash=item19bd969fbc:g:tt4AAOSwaH5mRa0g", "itemLocation": {"postalCode": "******", "country": "CN"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/qjgAAOSwoAlmRa0h/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/tt8AAOSwaH5mRa0h/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/tuAAAOSwaH5mRa0i/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/tuEAAOSwaH5mRa0i/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/-I8AAOSw6mZmRa0j/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/tuIAAOSwaH5mRa0j/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/3ZMAAOSwzxNmRa0k/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/tuMAAOSwaH5mRa0l/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/-JAAAOSw6mZmRa0l/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554947516", "availableCoupons": false, "itemCreationDate": "2024-05-16T06:52:28.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "item_description": "Pair RGB LED Laser Projector Whip Light Whipless Antenna Remote Cube UTV ATV CNC\nLaser LED Pods Additional Infor:\nSky Tracer Spot Beam delivers a precision-focused light beam, mirroring the effectiveness of Offroading Whip Lights.\n Designed for off-road enthusiasts, its primary goal is to enhance visibility, reducing collision risks during off-roading adventures.\n Additionally, it serves as a beacon, aiding in locating fellow rock crawlers in diverse terrains like deserts and forests during nighttime exploration.\n Universally compatible, this product ensures maximum visibility across various vehicles and powersports, proving invaluable in challenging environmental and weather conditions.\n WARNING: Avoid direct eye exposure and refrain from shining this light into people's eyes. This product is intended solely for off-road use and purposes.\n 3.2\" Laser RGB LED Whip Lights White Cube Pods\nType: RGBW Laser LED Whip lights Pods w/ Remote & Rocker Switch\nUsed For: Offroad Powersports Trucks SUV UTV RV Marine Boat and more\nMaterial: CNC Housing\nColor: Red, Green, Blue and White \nWeather For: dust, haze, fog, snow and other precipitation\nWaterproof: IP68 waterproof design with Breather & Stainless steel Waterproof Connect\nBeam Type: Fixed-focus beam / Spot beam (Up Higher）\nNumber of LED Chips: 2Pcs 25W High Power LED Chip\nMounting Bracket: Adjustable, Steady, Corrosion resistan\nHeat Sink: 9Pcs Heat Sink\nControlled By / Change Color: IR REMOTE CONTROL & ROCKER SWITCH CONTROL\nRocker Switch: OFF-ON-ON with Blue Backlight\nWireless Remote: ON-OFF with PVC bag and lanyard\nVoltage： Universal/compatible with any 12-volt electrical systems\n3\" Laser Pod Line： 5Pin Round Connector & 22inch & waterproof connector\nRocker Switch Line： 3Pin Round Connector & 16inch length， 47inch length with 10A Fuse short-circuit protection，\nRocker Switch RED Line： Connect to ACC, save your battery otherwise the unit is always on \nAluminum Bluetooth Control Box： 5Pin Round Connector & 89inch length， 3Pin Round Connector & 66inch length\nControl Box's antenna： Dont need connect & cant be cut off\nManufacturer Warranty： 36Months\nItem Weight: 4.85 lb\nNote: Do not shine in eyes, aircraft, or directly at vehicles\n Package:\n2x LASER RGB LED Whip Lights\n2x U-Shape Mounting Brackets\n1x Control Box\n1x Rocker Switch\n1x IR Remote\nHardware and Tools Shown In Images(M4 & M6)\nPayment\nShipping\nReture\nContact Us\nFeedback\nWe only accept payment via eBay by Paypal.\nItem will be shipped out within 3 business day after payment completed.\nPlease make sure your eBay address is correct before you pay.\nAll the unpaid case will automatically opened after 4 days because the ebay final value charge of the transaction\nBrand buymoremoreshop\nMaterial CNC\nUniversal Fitment Yes\nwhat's in the box 2x Laser RGB LED Whip Lights w/ Remote Rocker Switch\nMounting Hardware Included YES\nMachine Type ATV, UTV / SXS, Boat, Marine, Offroad\nUsed For Powersports Trucks SUV UTV RV Marine Boat and more\nColor Red, Green, Blue & White\nMounting Style Bolt-On, Screw-On\nNote Do not shine in eyes, aircraft, or directly at vehicles\nWeather For dust, haze, fog, snow and other precipitation\nWaterproof IP68 waterproof design\nBeam Type Fixed-focus beam / Spot beam\nLens Color Clear\nNumber of LED Chips 2Pcs 40W High Power LED Chips\nBreather Yes\nMounting Bracket Adjustable, Steady, Corrosion resistan\nHeat Sink 9Pcs Heat Sink\nManufacturer Part Number Tractor Beam 3\" Laser Pod Lights Whip Lights\nControlled By Wireless Remote / Rocker Switch\nRocker Switch OFF-ON-ON with Blue Backlight\nWireless Remote ON-OFF with PVC bag and lanyard\nVoltage Universal/compatible with any 12-volt electrical systems\n3\" Laser Pod Line 5Pin Round Connector & 22inch & waterproof connector\nRocker Switch Line 1side 3Pin Round Connector & 16inch length\nRocker Switch Line 2side 47inch length with 10A Fuse short-circuit protection，\nRocker Switch RED Line Connect to ACC, save your battery otherwise the unit is always on\nAluminum Bluetooth Control Box 1side 5Pin Round Connector & 89inch length\nAluminum Bluetooth Control Box 2side 3Pin Round Connector & 66inch length\nControl Box's antenna Dont need connect & cant be cut off\nManufacturer Warranty 1 Year\nItem Weight 4.85 lb"}
{"itemId": "v1|110554947519|0", "title": "Pair RGB LED Laser Projector Whip Light Whipless Antenna Remote Cube UTV ATV CNC", "leafCategoryIds": ["174065"], "categories": [{"categoryId": "174065", "categoryName": "Other Lighting & Lamps"}, {"categoryId": "33707", "categoryName": "Lighting & Lamps"}, {"categoryId": "6000", "categoryName": "eBay Motors"}, {"categoryId": "6028", "categoryName": "Parts & Accessories"}, {"categoryId": "6030", "categoryName": "Car & Truck Parts & Accessories"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/-JEAAOSw6mZmRa5h/s-l225.jpg"}, "price": {"value": "248.00", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554947519%7C0", "seller": {"username": "testuser_pa4_demo_1", "feedbackPercentage": "100.0", "feedbackScore": 1}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/-JEAAOSw6mZmRa5h/s-l1200.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE", "BEST_OFFER"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/Pair-RGB-LED-Laser-Projector-Whip-Light-Whipless-Antenna-Remote-Cube-UTV-ATV-CNC-/110554947519?hash=item19bd969fbf:g:-JEAAOSw6mZmRa5h", "itemLocation": {"postalCode": "******", "country": "CN"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/qjkAAOSwoAlmRa5h/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/-JIAAOSw6mZmRa5i/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/3ZQAAOSwzxNmRa5i/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/-JMAAOSw6mZmRa5j/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/-JQAAOSw6mZmRa5j/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/-JUAAOSw6mZmRa5k/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/-JYAAOSw6mZmRa5l/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/qjoAAOSwoAlmRa5l/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/-JcAAOSw6mZmRa5m/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554947519", "availableCoupons": false, "itemCreationDate": "2024-05-16T06:57:47.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "item_description": "Pair RGB LED Laser Projector Whip Light Whipless Antenna Remote Cube UTV ATV CNC\nLASER RGB LED Whip Lights Antenna Infor:\nSky Tracer Spot Beam delivers a precision-focused light beam, mirroring the effectiveness of Offroading Whip Lights.\n Designed for off-road enthusiasts, its primary goal is to enhance visibility, reducing collision risks during off-roading adventures.\n Additionally, it serves as a beacon, aiding in locating fellow rock crawlers in diverse terrains like deserts and forests during nighttime exploration.\n Universally compatible, this product ensures maximum visibility across various vehicles and powersports, proving invaluable in challenging environmental and weather conditions.\n WARNING: Avoid direct eye exposure and refrain from shining this light into people's eyes. This product is intended solely for off-road use and purposes.\n 3.2\" Laser RGB LED Whip Lights White Cube Pods\nType: RGBW Laser LED Whip lights Pods w/ Remote & Rocker Switch\nUsed For: Offroad Powersports Trucks SUV UTV RV Marine Boat and more\nMaterial: CNC Housing\nColor: Red, Green, Blue and White \nWeather For: dust, haze, fog, snow and other precipitation\nWaterproof: IP68 waterproof design with Breather & Stainless steel Waterproof Connect\nBeam Type: Fixed-focus beam / Spot beam ( Up Higher）\nNumber of LED Chips: 2Pcs 25W High Power LED Chip\nMounting Bracket: Adjustable, Steady, Corrosion resistan\nHeat Sink: 9Pcs Heat Sink\nControlled By / Change Color: IR REMOTE CONTROL & ROCKER SWITCH CONTROL\nRocker Switch: OFF-ON-ON with Blue Backlight\nWireless Remote: ON-OFF with PVC bag and lanyard\nVoltage： Universal compatible with any 12-volt electrical systems\n3\" Laser Pod Line： 5Pin Round Connector & 22inch & waterproof connector\nRocker Switch Line： 3Pin Round Connector & 16inch length， 47inch length with 10A Fuse short-circuit protection，\nRocker Switch RED Line：You can connect whip light to ACC first instead to the battery directly, avoid draining battery.      \nAluminum Bluetooth Control Box： 5Pin Round Connector & 89inch length， 3Pin Round Connector & 66inch length\nControl Box's antenna： Dont need connect & cant be cut off\nManufacturer Warranty： 36Months\nItem Weight: 4.85 lb\nNote: Do not shine in eyes, aircraft, or directly at vehicles\n Package:\n2x LASER RGB LED Whip Lights\n2x U-Shape Mounting Brackets\n1x Control Box\n1x Rocker Switch\n1x IR Remote\nHardware and Tools Shown In Images(M4 & M6)\nPayment\nShipping\nReture\nContact Us\nFeedback\nWe only accept payment via eBay by Paypal.\nItem will be shipped out within 3 business day after payment completed.\nPlease make sure your eBay address is correct before you pay.\nAll the unpaid case will automatically opened after 4 days because the ebay final value charge of the transaction\nBrand buymoremoreshop\nMaterial CNC\nUniversal Fitment Yes\nwhat's in the box 2x Laser RGB LED Whip Lights w/ Remote Rocker Switch\nMounting Hardware Included YES\nMachine Type ATV, UTV / SXS, Boat, Marine, Offroad\nUsed For Powersports Trucks SUV UTV RV Marine Boat and more\nColor Red, Green, Blue & White\nMounting Style Bolt-On, Screw-On\nNote Do not shine in eyes, aircraft, or directly at vehicles\nWeather For dust, haze, fog, snow and other precipitation\nWaterproof IP68 waterproof design\nBeam Type Fixed-focus beam / Spot beam\nLens Color Clear\nNumber of LED Chips 2Pcs 40W High Power LED Chips\nBreather Yes\nMounting Bracket Adjustable, Steady, Corrosion resistan\nHeat Sink 9Pcs Heat Sink\nManufacturer Part Number Tractor Beam 3\" Laser Pod Lights Whip Lights\nControlled By Wireless Remote / Rocker Switch\nRocker Switch OFF-ON-ON with Blue Backlight\nWireless Remote ON-OFF with PVC bag and lanyard\nVoltage Universal/compatible with any 12-volt electrical systems\n3\" Laser Pod Line 5Pin Round Connector & 22inch & waterproof connector\nRocker Switch Line 1side 3Pin Round Connector & 16inch length\nRocker Switch Line 2side 47inch length with 10A Fuse short-circuit protection，\nRocker Switch RED Line Connect to ACC, save your battery otherwise the unit is always on\nAluminum Bluetooth Control Box 1side 5Pin Round Connector & 89inch length\nAluminum Bluetooth Control Box 2side 3Pin Round Connector & 66inch length\nControl Box's antenna Dont need connect & cant be cut off\nManufacturer Warranty 1 Year\nItem Weight 4.85 lb"}
{"itemId": "v1|110554930785|0", "title": "Shake Awake Red Dot Sight for 2 MOA 1x20mm Dot Optics 10 Brightness Settings", "leafCategoryIds": ["66827"], "categories": [{"categoryId": "66827", "categoryName": "Red Dot & Laser"}, {"categoryId": "888", "categoryName": "Sporting Goods"}, {"categoryId": "7301", "categoryName": "Hunting"}, {"categoryId": "31710", "categoryName": "Scopes, Optics & Lasers"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/eBYAAOSwFLBmPeMo/s-l225.jpg"}, "price": {"value": "68.99", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554930785%7C0", "seller": {"username": "testuser_pa4_demo_1", "feedbackPercentage": "100.0", "feedbackScore": 1}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/eBYAAOSwFLBmPeMo/s-l1600.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE", "BEST_OFFER"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/Shake-Awake-Red-Dot-Sight-for-2-MOA-1x20mm-Dot-Optics-10-Brightness-Settings-/110554930785?hash=item19bd965e61:g:eBYAAOSwFLBmPeMo", "itemLocation": {"country": "CN"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/wSEAAOSwfVJmPeMp/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/m4UAAOSwHa1mPeMr/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/m5kAAOSw40VmPeMs/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/1SwAAOSwq15mPeMs/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/cX8AAOSwjV5mPeMu/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/sT0AAOSwXwFmPeMu/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/YT8AAOSwITZmPeMv/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/9~8AAOSwgSBmPeMw/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554930785", "availableCoupons": false, "itemCreationDate": "2024-05-10T09:10:41.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "listingMarketplaceId": "EBAY_US", "item_description": "About this item:\n\n-Motion Awake: After 4 minutes of inactivity, the red dot sight will enter sleep mode.   When the red dot detects motion, it automatically turns on with your last saved brightness setting, ensuring immediate usability.\n-Clear View: 20mm fully multi-coated lenses and larger aperture increase light transmission during low-light situations.   2 MOA red dot and 10 bright settings(including 2NV) provide a precise point and optimal visibility in any light conditions.\n-Durability: The red dot sight is constructed with 6061-T6 aluminum alloy, ensuring strength.   The red dot is fully sealed and nitrogen-filled, making it anti-fog and IPX7 --waterproof.   With a 1000g shockproof rating and a CR2032 battery life of 50000H, it guarantees reliable performance in any environment.\nEasy to Use: reflex sight provides parallax-free and unlimited eye relief for increased accuracy, comes with a 0.83in absolute co-witness raiser mount and a low profile raiser mount, for picatinny.   Meet your different usage scenarios.\nButton Adjustment\nPress and hold the \"+\" or \"-\" button for 3 seconds to turn on/off. 10 brightness levels including 2NV.\nW/E Adjustment\nAdjust windage and elevation without tools, easy to zero.\n50000H Battery Life\nThe Red dot comes with 2 CR2032 batteries, no need to worry about running out of power or frequent battery changes.\nClear View\nThe fully multi-coated lens is clear, avoiding distortion and providing the crispest red dot possible.\n     "}
{"itemId": "v1|110554925407|0", "title": "2000W EBike Electric Bicycle 26\" Fat Tire 48V 23Ah Dual Motor 35MPH 21 Speed", "leafCategoryIds": ["74469"], "categories": [{"categoryId": "74469", "categoryName": "Electric Bicycles"}, {"categoryId": "888", "categoryName": "Sporting Goods"}, {"categoryId": "7294", "categoryName": "Cycling"}], "image": {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/rMEAAOSwMNxmOk~A/s-l225.jpg"}, "price": {"value": "1100.00", "currency": "USD"}, "itemHref": "https://api.sandbox.ebay.com/buy/browse/v1/item/v1%7C110554925407%7C0", "seller": {"username": "testuser_pa4_demo_6", "feedbackPercentage": "0.0", "feedbackScore": 500}, "condition": "New", "conditionId": "1000", "thumbnailImages": [{"imageUrl": "http://i.ebayimg.sandbox.ebay.com/images/g/rMEAAOSwMNxmOk~A/s-l1600.jpg"}], "shippingOptions": [{"shippingCostType": "FIXED", "shippingCost": {"value": "0.00", "currency": "USD"}}], "buyingOptions": ["FIXED_PRICE", "BEST_OFFER"], "itemWebUrl": "http://www.sandbox.ebay.com/itm/2000W-EBike-Electric-Bicycle-26-Fat-Tire-48V-23Ah-Dual-Motor-35MPH-21-Speed-/110554925407?hash=item19bd96495f:g:rMEAAOSwMNxmOk~A", "itemLocation": {"city": "Los Angeles", "postalCode": "900**", "country": "US"}, "additionalImages": [{"imageUrl": "https://i.ebayimg.com/thumbs/images/g/LFkAAOSwagJmOeMq/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/iHYAAOSwm2hmOeMs/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/Mn8AAOSwLYpmOeMv/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/M3YAAOSwXGBmOk8Q/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/2ZsAAOSwwJxmOk8P/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/cKYAAOSwKPBmOk8N/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/fW0AAOSwC~NmOk8N/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/D6EAAOSwLGZmOk8N/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/VsIAAOSwLDNmOk8N/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/tf4AAOSwcMBmOk8O/s-l225.jpg"}, {"imageUrl": "https://i.ebayimg.com/thumbs/images/g/vGYAAOSw29pmOk8O/s-l225.jpg"}], "adultOnly": false, "legacyItemId": "110554925407", "availableCoupons": false, "itemCreationDate": "2024-05-07T15:59:05.000Z", "topRatedBuyingExperience": false, "priorityListing": false, "listingMarketplaceId": "EBAY_US", "item_description": "The item is UL 2849 certified with a link to the UL Product iQ <https://productiq.ulprospector.com/en>\n About this item:\n★ Powerful Motor E-bike: The V3 is a powerful all-wheel drive electric bike for adults. 2000W brushless motor (1000W front and rear) with Shimano 21-speed gear for an easy ride, with a top speed of about 33MPH, with a long range of more than 40 miles. Equipped with 48V, 23AH detachable lithium battery, so you can bring the battery to your home or office to recharge. Charging time: Approximately 6-8 hours, 2000 cycles of charging.\n ★  Fat Tires 26\"x4.0\" Ebike: Fat Tire and front suspension to ride smoothly on any terrain, including rocky roads, sandy beaches, snowy suburbs and so on.\n ★  Hydraulic Disc Brakes:The front and rear hydraulic brake system with power-off function offers an easy brake within 2 seconds, which provide more effective braking in rainy weather, heavy off-road, long downhill, high-speed riding and adverse conditions, stop the e-bike quickly and smoothly. Equipped with 21 speed gears, more accurate and stable. The lockable aluminum suspension front fork has a good shock absorption effect, which can offer you safer and comfortable riding experience.\n ★  Smart Display: Mileage 5-speed LCD display computer shows your speed per hour, total distance and remaining battery power for a better riding experience. You can then control the display of miles or kilometers as a unit of speed or mileage through the settings menu.\n ★  5 Riding Modes: Including pedal assist mode, throttle mode, normal bike mode, cruise control mode, and walking mode. Elevate your off-road adventures with our mountain bike. Unleash the thrill of conquering diverse terrains, from rugged mountain trails to challenging off-road paths. Multiple modes are suitable for different road conditions, making your riding journey more fun.\n ★  Easy installation:85% of the bike is pre-installed, you only need to manually install a few simple accessories.\n ★  1 Year Warranty:We provide 1 year warranty. If you have any questions about this item please directly contact us.\nWarm Tips:\n1.New electric bike passes road test before packing, therefore dust on the tires is inevitable.\n2.Upon arrival, mark down the serial number, which locates on the middle axle tube, and register to vehicle management center. It is necessary to track your ebike while preventing loss.\n3.Please be aware of the height of electric bike.\n Specification:\n Bike Type E-Bike\nAge Range Adult\nBrand KETELES\nNumber of Speeds 21\nColor BLUE\nWheel Size 26 Inches\nBrake Style Disc\nFrame Aluminum\nFork Aluminum Alloy Suspension Fork with Lockout\nBrake  Hydraulic Brake with Power Cut-off Feature\nThrottle Twist Throttle on the Right side of Handlebar\nDisplay Smart LCD display that shows speed, battery status,\npedal assist level, etc.\nRange Fully Electric Mode Range: around 40~60km\nPedal Assist Mode Range: around 70~90km\nVoltage 48 Volts (DC)\nModel Name V3\nWattage 2000 watts\nItem Weight 38kg\nMaximum Weight Recommendation 200 Kilograms\nWarranty 1 year\nSuggested Users Unisex-adult\n Package Included:\n*1 x Electric bicycle\n*1 x Headlight\n*2 x Fenders\n*1 x Charger\n*1 x Battery\n*1 x Tool kit\n*8 x Tools\n*2 x Pedals\n*1 x Taillight\n*1 x Rear rack\n*1 x Air cylinder\n*1 x Lock\n 1.Package can be shipped out to you within 24-48 hours from USA，The default expected delivered time is 2-7 working days.If you have any questions or issue about delivery, please contact us via eBay Messages and we will do our best to make sure you’re happy.\n2.We will provide 1 year warranty. And you may return all products within 30 days of delivery for replacement or refund if you're unsatisfied with them.\n3.If you would like to return your product, please contact us within 30 days of the sale date so we can offer the pre-label. This must be done through eBay messages. Please do not return a product without first contacting us.\n4.Buyers are responsible for appropriate packing, returning shipping cost, insurance and returning the item in “new” condition. Used items will not be accepted for return.\n5.If you received wrong of defective products, please take photos and contact us to confirm.For the returned products, we will arrange a new replacement or issue a refund after we have received your package and inspected it"}
